{"totalPages":5,"totalElements":21,"pageable":{"pageNumber":0,"pageSize":5,"sort":{"sorted":false,"empty":true,"unsorted":true},"offset":0,"paged":true,"unpaged":false},"size":5,"content":[{"id":58,"tenantId":100101118,"createdUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"modifiedUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"createdAt":"2025-11-17T08:13:32.536+00:00","updatedAt":"2025-12-03T06:09:03.204+00:00","publishStatus":"PUBLISHED","publishedBy":null,"asyncElasticSearch":true,"isDeletedBy":null,"isDeleted":false,"allowDownloads":true,"allowGuestUsersToWatch":true,"allowEarlyAccess":true,"maturityRating":"PG_13","maturityRatingTxtField":null,"listingCountryType":"BLACKLISTING_COUNTRIES","countries":[{"id":26,"name":"Argentina"}],"earlyAccessDate":"2025-01-01","vttUrl":"https://example.com/media/interstellar_test","contentStatus":"UNPUBLISHED","posterConversionStatus":"UNPUBLISHED","title":{"titleEn":"28","titleSi":"28","titleTa":"28"},"slug":"28","description":"A grieving husband fights shame and heartbreak after his wife is brutally assaulted and killed, while her spirit rises to confront a society that silenced her, speaking boldly for all women at her own funeral.","releaseDate":"2014-01-24","runtime":"PT0138M","publishDate":null,"unPublishDate":null,"director":[{"id":87,"name":"Prasanna Jayakody","bio":"Prasanna Jayakody\n\nFilm Director | Screenwriter | Visual Storyteller\n\nPrasanna Jayakody (born August 25, 1968) is one of Sri Lanka’s most acclaimed contemporary filmmakers and screenwriters, celebrated for his poetic visual language and deep humanism. Educated at Taxila Central College in Horana, Jayakody transitioned from television to cinema, bringing a new cinematic voice defined by introspection, spirituality, and realism. His work often explores inner conflict, moral ambiguity, and the silent spaces of human emotion.\n\nSignature Works\n\nSankara (2007) – Jayakody’s directorial debut; won the Silver Pyramid Award at the Cairo International Film Festival and the NETPAC Award for Best Asian Film at Kerala IFF.\nKarma (2012) – A meditative study of guilt, redemption, and spiritual transcendence; acclaimed for its minimalist narrative.\n28 (2014) – A socially charged road drama exploring mortality and class divide through the journey of a dead body.\nLeopard Do Not Bite (2015) – A metaphorical reflection on violence and innocence in post-war Sri Lanka.\nDadayakkaraya (2019) – A psychological exploration of solitude and the search for identity.\n\nTelevision Career\n\nBefore his cinematic success, Jayakody directed several award-winning teledramas that shaped his early artistic identity:\nAwasana Horawa (The Final Hour, 1998) – won Best Young Director at the Sumathi Tele Awards.\nNisala Vila (The Still Pond, 1999)\nImadiyamankada (At the Crossing, 2000)\nSanda Amawakayi (The Moon Eclipsed, 2002)\nHada Vila Sakmana (2003)\n\nThese works established his reputation for capturing silence, atmosphere, and emotional realism.\n\nAwards & Recognition\n\nSilver Pyramid Award – Cairo International Film Festival (2007)\n\nNETPAC Award for Best Asian Film – Kerala International Film Festival (2007)\n\nJury Special Prize – Turkey Silk Road Film Festival (2007)\n\nMultiple international festival screenings and critical acclaim for 28 and Karma.\n\nStyle & Impact\n\nPrasanna Jayakody’s films are marked by:\n\nMinimal dialogue and profound visual storytelling.\n\nThemes of spirituality, morality, and inner conflict.\n\nA blend of realism and poetic metaphor that defines his cinematic signature.\n\nGlobal recognition as one of Sri Lanka’s leading auteurs in the international film circuit.\n\nFestival Favorites: Titles like Sankara, Karma, and 28 are critically revered and ideal for curated world-cinema selections.\n\nArt House Appeal: Perfect for global viewers seeking spiritual and philosophical cinema from South Asia.\n\nCultural Depth: Bridges Sri Lankan heritage with modern existential storytelling, enhancing OTT library diversity.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764055695879-Prasanna-Jayakody.jpg","roleCommonResDTO":null}],"producer":[],"cast":[{"priorityNo":1,"castMemberCommonResDTO":{"id":87,"name":"Prasanna Jayakody","bio":"Prasanna Jayakody\n\nFilm Director | Screenwriter | Visual Storyteller\n\nPrasanna Jayakody (born August 25, 1968) is one of Sri Lanka’s most acclaimed contemporary filmmakers and screenwriters, celebrated for his poetic visual language and deep humanism. Educated at Taxila Central College in Horana, Jayakody transitioned from television to cinema, bringing a new cinematic voice defined by introspection, spirituality, and realism. His work often explores inner conflict, moral ambiguity, and the silent spaces of human emotion.\n\nSignature Works\n\nSankara (2007) – Jayakody’s directorial debut; won the Silver Pyramid Award at the Cairo International Film Festival and the NETPAC Award for Best Asian Film at Kerala IFF.\nKarma (2012) – A meditative study of guilt, redemption, and spiritual transcendence; acclaimed for its minimalist narrative.\n28 (2014) – A socially charged road drama exploring mortality and class divide through the journey of a dead body.\nLeopard Do Not Bite (2015) – A metaphorical reflection on violence and innocence in post-war Sri Lanka.\nDadayakkaraya (2019) – A psychological exploration of solitude and the search for identity.\n\nTelevision Career\n\nBefore his cinematic success, Jayakody directed several award-winning teledramas that shaped his early artistic identity:\nAwasana Horawa (The Final Hour, 1998) – won Best Young Director at the Sumathi Tele Awards.\nNisala Vila (The Still Pond, 1999)\nImadiyamankada (At the Crossing, 2000)\nSanda Amawakayi (The Moon Eclipsed, 2002)\nHada Vila Sakmana (2003)\n\nThese works established his reputation for capturing silence, atmosphere, and emotional realism.\n\nAwards & Recognition\n\nSilver Pyramid Award – Cairo International Film Festival (2007)\n\nNETPAC Award for Best Asian Film – Kerala International Film Festival (2007)\n\nJury Special Prize – Turkey Silk Road Film Festival (2007)\n\nMultiple international festival screenings and critical acclaim for 28 and Karma.\n\nStyle & Impact\n\nPrasanna Jayakody’s films are marked by:\n\nMinimal dialogue and profound visual storytelling.\n\nThemes of spirituality, morality, and inner conflict.\n\nA blend of realism and poetic metaphor that defines his cinematic signature.\n\nGlobal recognition as one of Sri Lanka’s leading auteurs in the international film circuit.\n\nFestival Favorites: Titles like Sankara, Karma, and 28 are critically revered and ideal for curated world-cinema selections.\n\nArt House Appeal: Perfect for global viewers seeking spiritual and philosophical cinema from South Asia.\n\nCultural Depth: Bridges Sri Lankan heritage with modern existential storytelling, enhancing OTT library diversity.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764055695879-Prasanna-Jayakody.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":2,"castMemberCommonResDTO":{"id":88,"name":"Rasitha Jinasena","bio":"Film Producer | Creative Visionary | Curator of Definitive Sri Lankan Cinema\n\nRasitha Jinasena is a prominent Sri Lankan film producer known for backing some of the most artistically significant and commercially impactful films of the last decade. His portfolio spans festival hits, critically acclaimed dramas, and youth-driven mainstream cinema. From the spiritual minimalism of Leopard Do Not Bite to the dynamic social narratives of Uthuru Sulanga and Yaaluwoda? Yaaluida?, Jinasena has emerged as a producer with strong artistic instincts and an eye for cinematic storytelling that resonates with both local and global audiences.\n\nWith credits across feature films, executive production, and drama, he has helped shape Sri Lanka’s evolving cinematic identity by supporting bold directors, fresh talent, and stories that break away from formula.\n\nSignature Works\n\nUthuru Sulanga (2023) – Producer\nA compelling urban-rural psychological drama; praised for its emotional depth, powerful performances, and atmospheric direction.\n\nYaaluwoda? Yaaluida? (2023) – Producer\nA vibrant youth-oriented film featuring an ensemble cast; blends romance, music, and social commentary.\n\nWhispering Mountains (2023) – Producer\nA high-rated atmospheric drama exploring human conflict and spiritual introspection.\n\nWithered Leaf (2016) – Executive Producer\nA tender and thoughtful drama praised for its visual poetry and narrative subtlety.\n\nLeopard Do Not Bite (2015) – Producer\nA festival-acclaimed art-house film; known for its quiet tension, symbolism, and striking cinematography.\n\n28 (2014) – Producer\nA road-movie-style social drama that explores caste, mortality, and human dignity during a journey with a corpse.\n\nKusa Paba (2012) – Producer\nA major historical epic featuring Jackson Anthony and Pooja Umashankar; visually rich and based on Buddhist legend.\n\nKarma (2010) – Producer\nA groundbreaking spiritual drama exploring redemption, guilt, and rebirth; praised for its minimalist aesthetic.\n\nStyle & Impact\n\nRasitha Jinasena is known for:\n\nSupporting director-driven cinema with strong artistic merit.\n\nBacking emotionally complex, visually expressive storytelling.\n\nTaking risks on non-mainstream narratives that later became critical successes.\n\nBridging commercial appeal and festival-quality filmmaking.\n\nHis productions often feature:\n\nPhilosophical undertones\n\nRealistic human conflict\n\nStrong character psychology\n\nStunning cinematography\n\nDeep cultural and spiritual themes\n\nInternational Appeal: Festival favorites like Leopard Do Not Bite, 28, and Karma fit curated world cinema collections.\n\nYouth Engagement: Films such as Yaaluwoda? Yaaluida? offer high entertainment value for younger audiences.\n\nHigh Ratings: Many titles exceed 7.0 IMDb, ideal for global OTT recommendation algorithms.\n\nGenre Diversity: From historic epics to psychological dramas, his catalog enriches an OTT platform’s cinematic depth.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764055890129-Rasitha-Jinasena.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":3,"castMemberCommonResDTO":{"id":89,"name":"Semini Iddamalgoda","bio":"Actress | Stage Performer | Television Icon\n\nSemini Dinusha Palihawadana, popularly known as Semini Iddamalgoda, is one of Sri Lanka’s most versatile and enduring actresses, recognized for her powerful presence across cinema, theatre, and television. Active since 1994, she has portrayed a wide spectrum of characters, from comedic favourites to emotionally complex dramatic roles. She is best known for her iconic portrayal of Roshini in the hit sitcom Yes Boss, the role Kumari in Sinahawa Atharin, and the unforgettable Suddi in the acclaimed film 28. Semini’s ability to shift between humour, romance, and deep emotional grit has made her a household name in the Sri Lankan entertainment industry.\n\nSignature Works on OTT\n\n28 (2017) – Played Suddi, one of her most critically acclaimed dramatic performances.\nSinahawa Atharin (2015) – Memorable role as Kumari in Udayakantha Warnasuriya’s romantic drama.\nSudu Hansi (2010) – Portrayed Shami in the psychological thriller.\nRosa Wasanthe (2001) – Debuted as Mihiri in Udayakantha Warnasuriya’s film.\nYakada Pihatu (2003) – Appeared as Surangi in the intense action drama.\nNilambare (2006) – Played a significant emotional role as Nimal’s wife.\nRan Kevita (2007) – Acted as Janith’s mother in the popular fantasy film.\nAli Surathal (2009) – Played Manju in the action-thriller.\nKo Mark No Mark (2014) – Appeared as Mrs. Palatupana.\nMandara (2024) – Latest major performance.\n\n📺 Television Highlights\n\nOne of the most prolific teledrama actresses of her generation, Semini has starred in dozens of major series including:\n\nYes Boss – as Roshini, her most adored comedy role.\n\nIrabatu Tharuwa – Award-winning performance that marked her rise.\n\nAbhisamaya\n\nAmuthu Dosthara\n\nDedunu Sihina\n\nKadupul Mal\n\nKaruwala Gedara\n\nMaya Agni\n\nSathya\n\nNonimi Yathra\n\nVisirunu Renu\n\nWara Mal\n\nSwayanjatha\n\nTharupaba\n\nThe Lake\n\nHer versatility across genres—romance, comedy, thriller, and family drama—made her a favourite in prime-time programming.\n\nStage Career\n\nSemini is an award-winning stage actress celebrated for her performance in:\n\nPunchi Adara Balakirima – won Best Actress at the State Drama Festival.\n\nHer theatre background strengthens the emotional depth and craft she brings to screen roles.\n\nBeyond Acting\n\n2nd Runner-Up, Mrs. Sri Lanka 1999\n\nHosted the TV program Semini Samaga Mathaka Mawatha on TV Derana\n\nParticipant in Sirasa Dancing Stars and Hiru Mega Stars\n\nAwards & Recognition\n\nSumathi Awards\n\nBest Upcoming Actress – Irabatu Tharuwa (2001)\n\nMerit Award – Ithin Mata Awasarai (2012)\n\nSarasaviya Awards\n\nMerit Award – Yakada Pihatu (2001)\n\nState Drama Festival\n\nBest Actress – Punchi Adara Balakirima\n\nPresidential Film Awards\n\nBest Actress Nomination – Sinahawa Atharin (2015)\n\nStyle & Impact\n\nSemini Iddamalgoda is admired for:\n\nSeamlessly shifting between comedy and intense drama\n\nStrong emotional performances rooted in theatre discipline\n\nLongevity and relevance across three decades\n\nMemorable characters in both mainstream and artistic productions\n\nA relatable screen presence that connects deeply with audiences","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764055970636-Semini-Iddamalgoda.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":4,"castMemberCommonResDTO":{"id":53,"name":"Mahendra Perera","bio":"Actor · Stage Performer · Art Director\nSri Lanka · Active since 1978\n\nMahendra Perera is one of the most influential and versatile actors in Sri Lankan cinema, equally acclaimed for his dramatic depth and comedic timing. With a career spanning over four decades, he has appeared in more than 70 films, numerous television serials and multiple stage productions — becoming a defining screen presence in Sinhala cinema.\n\nBorn in Mount Lavinia, Mahendra began exploring music and performance while still in school, later training under legendary theatre masters including Dhamma Jagoda, Dr. Solomon Fonseka and Tony Ranasinghe. His rise began with Sakwithi Suwaya (1978) and Sagarayak Meda (1981), leading to standout roles in landmark films such as Aswesuma, Mille Soya, Bahubuthayo, Kosthapal Punyasoma, Sulanga Enu Pinisa, 28, Gindari and Address Na.\n\nKnown for shifting effortlessly between hero, villain, comic relief and character roles, he is one of the few actors to maintain equal success in film, TV and stage. He also worked behind the camera as art director (Julietge Bhumikawa, Pawuru Walalu) and assistant director (Koti Waligaya).\n\nCareer highlights\n• 40+ years in cinema, theatre and television\n• Known for Aswesuma, Bahubuthayo, Mille Soya, Kosthapal Punyasoma, 28\n• Award-winning actor at the Sarasaviya Awards and Presidential Film Awards\n• Frequently cast by directors Sumitra Peries, Vasantha Obeysekera, Udayakantha Warnasuriya and Jayantha Chandrasiri\n• Notable for unforgettable comedic characters like Lanty in Bahubuthayo and Gindari\n\nSignature roles\nBerty Malli (Sakwithi Suwaya)\nSammy (Gini Avi Saha Gini Keli)\nLanty (Bahubuthayo / Gindari)\nKulatunga (Randiya Dahara)\nAbasiri (28)\nWilson (Kathuru Mithuru)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504364702-Mahendra-Perera.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":5,"castMemberCommonResDTO":{"id":90,"name":"Sarath Kothalawala","bio":"Actor | Director | Producer | Screenwriter\n\nSarath Kothalawala is a distinguished Sri Lankan actor, director, producer, and screenwriter with a career spanning over three decades. Renowned for his versatility, he has delivered unforgettable performances across cinema, theatre, and television. His ability to embody complex characters in both comedic and deeply dramatic roles has cemented him as one of Sri Lanka’s most respected artistic voices.\n\nHis breakout as co-writer and actor in Thanha Rathi Ranga earned him sweeping critical praise, including Best Actor and Best Screenplay at major national awards. From stage classics to contemporary cinema, Kothalawala’s work reflects a mastery of craft shaped by 15 years of dedicated study in theatre and performance.\n\nSignature Works on OTT\n\nThanha Rathi Ranga (2014) – Co-writer & Actor (Sirithunga); Award-winning performance recognised at Derana Lux Film Awards and Hiru Golden Film Awards.\n28 (2017) – Played Lenin, a bold and emotionally charged portrayal in this acclaimed social drama.\nThe Newspaper (2020) – Co-directed and acted as Guna; praised for its social commentary and realism.\nSinhawalokanaya (2011) – Played Tikka in the patriotic action drama.\nDr. Nawariyan (2017) – Appeared as Doctor Roshan.\nMachan (2008) – Played a comedic supporting role as the Muslim Man.\nKolomba Sanniya Returns (2018) – Portrayed Andiris in a modern retelling of the comedic classic.\nPadadaya (1999) – First major film appearance as a Revolutionary Leader.\n\nKothalawala’s filmography extends across 50+ cinematic roles, reflecting stunning range and longevity.\n\nStage Career\n\nSarath Kothalawala is regarded as one of the most important theatre actors of his generation. Having performed in over 80 stage plays, he is known for productions such as:\n\nSookarayek Samaga\n\nNari Burathi 1 & 2\n\nGabbara Minisa\n\nGutikamata Niyamithai\n\nMandela Mandela\n\nEka Sakkuwe\n\nCharithe Horu Aran\n\nHis stage mastery laid the foundation for his precision, emotional depth, and commanding presence on screen.\n\nTelevision Highlights\n\nA prolific performer across teledrama, Kothalawala has starred in numerous hit serials, including:\n\nAhas Gawwa\n\nDeweni Yuddhaya\n\nMonarathenna\n\nMati Kadulu\n\nJeewithaya Horu Aran\n\nSikuru Wasanthe\n\nParasathu Mal\n\nInternasanal 1 & 2\n\nRathi Virathi\n\nWarna\n\nSanda Dev Diyani\n\nSedona\n\nHis roles span comedy, mystery, horror, political satire, and family drama.\n\nAwards & Recognition\n\nBest Actor – Thanha Rathi Ranga, Derana Lux Film Awards (2014)\n\nBest Screenwriter – Thanha Rathi Ranga, Derana Lux Film Awards (2014)\n\nBest Actor – Hiru Golden Film Awards (2016)\n\nJury Award – Grahambell Wath Sithuwada, Sumathi Awards (2017)\n\nMerit Award – Grahambell Wath Sithuwada, Raigam Tele’es (2017)\n\nHis impressive collection of awards reflects the depth of his craft and the respect he commands.\n\nStyle & Impact\n\nSarath Kothalawala is admired for:\n\nDeeply human, emotionally layered performances\n\nSeamless transition between theatre and film acting\n\nStrong character embodiment in socially driven narratives\n\nContributions to the evolution of modern Sri Lankan cinema\n\nCollaborative creativity with Kumara Thirimadura, forming a powerful artistic duo\n\nCourageous exploration of social issues, politics, and identity through art","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764056195061-Sarath-Kothalawala.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":6,"castMemberCommonResDTO":{"id":91,"name":"Nilmini Kottegoda","bio":"Actress | Performer | Public Figure\n\nNilmini Kottegoda is a celebrated Sri Lankan actress known for her versatility, emotional depth, and magnetic screen presence. Over the years, she has earned recognition as a leading figure in television and cinema, captivating audiences with her powerful performances and ability to adapt seamlessly across genres. Whether portraying strong dramatic roles or lighter character-driven narratives, Nilmini has built a respected name in the entertainment industry.\n\nWith an engaging public persona and a loyal fan base, Nilmini maintains an active online presence. Through various social media platforms, she connects with audiences, shares creative updates, and offers glimpses into her professional journey.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764056308417-Nilmini-Kottegoda.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":7,"castMemberCommonResDTO":{"id":92,"name":"Daya Thennakoon","bio":"Legendary Actor | Dramatist | Pioneer of Sri Lankan Television\n\nDaya Bandara Thennakoon (1941–2020) remains one of Sri Lanka’s most respected and influential actors, celebrated for his profound contributions to cinema, stage drama, and television. Renowned for his emotional depth, signature style, and intellectual approach to performance, he built a remarkable career spanning more than five decades. From landmark films like Hanthane Kathawa, Bambaru Awith, Karumakkarayo, and Sakman Maluwa to iconic stage and television work, Thennakoon became a pillar of Sri Lankan performing arts.\n\nA graduate of the University of Ceylon, he first entered the creative world through the guidance of filmmaker Dharmasena Pathiraja and soon evolved into a versatile performer whose characters carried realism, intensity, and quiet power. He was also a radio professional, director, educator, and pioneer of the first-ever Sri Lankan television music video, cementing his legacy as a creative visionary.\n\nSignature Career Highlights\nCinema\n\nDaya Thennakoon debuted in Hanthane Kathawa (1969) as “Naatha,” marking the beginning of an extraordinary film career. Some of his most acclaimed performances include:\n\nAhas Gawwa (1974)\n\nBambaru Awith (1978)\n\nKarumakkarayo (1980)\n\nSeilama (1995) – Award-winning performance\n\nSakman Maluwa (2003)\n\nSoldadu Unnehe, Swaroopa, Dedunu Akase, 28\n\nHis roles often portrayed everyday Sri Lankans with truthfulness and complexity.\n\nStage & Television\n\nA theatrical craftsman, Thennakoon performed in and contributed to many iconic productions:\n\nBosathaneni\n\nDunnu Dunugamuwe\n\nNettukkari\n\nHitha Honda Ammandi\n\nKora Saha Andhaya\n\nOn television, he achieved nationwide popularity through series like:\n\nThattu Gewal\n\nAndukola\n\nSansungama Andaraya\n\nVeedi Pahan\n\nHe later became a sought-after director and creative producer in television, commercials, and documentaries.\n\nAwards & Recognition\n\nDaya Thennakoon earned numerous prestigious honors throughout his lifetime:\n\nFIPRESCI Critics Award (1994) – Tharanaya\n\nSwarna Sanka Cinema Award (1996) – Best Supporting Actor for Seilama\n\nSarasaviya Award (1998) – Best Performance for Tharanaya\n\nMerit Award – Sakman Maluwa (2003)\n\nHis performances remain benchmarks in Sri Lankan performing arts.\n\nLegacy & Impact\n\nPioneer of Sri Lanka’s first televised music video.\n\nElevated realistic acting in cinema and stage.\n\nMentored by and collaborated with iconic directors like Dharmasena Pathiraja and Sugathapala de Silva.\n\nLeft behind a body of work that continues to shape actors and storytellers across generations.\n\nDaya Thennakoon’s contribution is woven into the cultural fabric of Sri Lankan arts — a legacy of brilliance, discipline, and authenticity.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764056428952-Daya-Tennakoon.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":8,"castMemberCommonResDTO":{"id":94,"name":"Rukmal Nirosh","bio":"Film Editor | Actor | Creative Storyteller\n\nRukmal Nirosh is an accomplished Sri Lankan film editor and actor known for his sharp storytelling instincts and refined cinematic eye. With a career spanning nearly two decades, he has worked across feature films, shorts, and television projects, shaping some of the most acclaimed modern Sri Lankan productions. His editorial signature blends emotional rhythm, visual precision, and narrative clarity, making him one of the industry’s sought-after editing talents.\n\nAs an actor, Rukmal is best recognized for his role as Mani in the award-winning film 28 (2014), where he delivered an understated yet memorable performance. His dual presence in front of and behind the camera highlights his versatility and deep commitment to the craft of filmmaking.\n\nKey Acting Highlights\n\n28 (2014)\n\nRole: Mani\nIMDb Rating: 6.9\nA powerful drama where his nuanced acting contributed to the film’s critical and festival success.\n\nEditorial Portfolio\n\nRukmal Nirosh’s editing credits span feature films, short films, and television movies, consistently praised for pacing, emotional balance, and narrative flow.\n\nFeature Films\n\nIce Cream (2025) – Editor\n\nThe Wandering Life (2021) – Editor\n\nThe Newspaper (2020) – Editor\n\nBimba Devi Alias Yashodhara (2018) – Editor\n\nSankranthi (2007) – Editor\n\nSamaara (2006) – Editor\n\nShort Films\n\nGet Ready (2012) – Editor\n\nRakkas (2011) – Editor\n\nTelevision\n\nKokila Sandwaniya – TV Movie – Editor\n\nRukmal’s editing work in The Wandering Life (2021) and The Newspaper (2020) stands out for its cinematic finesse, contributing significantly to both films' critical acclaim.\n\nStyle & Contribution\n\nExpertise in emotional and character-driven editing\n\nAbility to elevate dramatic tension and realism\n\nTrusted collaborator for directors seeking clean, immersive narratives\n\nStrong cross-medium experience across film, shorts, and TV formats","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764056654039-Rukmal-Nirosh.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}}],"subtitles":[],"genres":[{"genreId":28,"genreName":"Drama"},{"genreId":38,"genreName":"Mystery"}],"keywords":[{"keywordId":23,"keywordName":"Movie"},{"keywordId":30,"keywordName":"Mystery"}],"video":{"id":99,"title":"28","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/28_HLS/master.m3u8","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/28_HLS/master.m3u8","conversionStatus":"COMPLETE","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"posters":[{"id":918,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360816146-28__without_tittel_landscape_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360816146-28__without_tittel_landscape_base_template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":919,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360825310-28__with_tittel_landscape_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360825310-28__with_tittel_landscape_base_template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":920,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360828280-28_Titel.png","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360828280-28_Titel.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":921,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"BACKGROUND_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360837217-28__without_tittel_landscape_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360837217-28__without_tittel_landscape_base_template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":922,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360843523-28__with_tittel_portrait_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360843523-28__with_tittel_portrait_base_template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":923,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763360845423-28__without_tittel_portrait_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763360845423-28__without_tittel_portrait_base_template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"}],"mediaTrailer":{"id":108,"title":"28 Film - Official Trailer","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1763361396023-28 Film - Official Trailer.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1763361396023-28%20Film%20-%20Official%20Trailer/master.m3u8","conversionStatus":"TRANSCODED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"monetization":{"freeClientPackage":[5],"advertisingAllowed":false,"payToWatchPackageDTOS":[{"payToWatchClientPackageId":2,"priceLkr":100.0,"priceUsd":1.0,"rentalDurationInDays":7,"watchingDurationInDays":3},{"payToWatchClientPackageId":6,"priceLkr":100.0,"priceUsd":1.0,"rentalDurationInDays":7,"watchingDurationInDays":3},{"payToWatchClientPackageId":3,"priceLkr":100.0,"priceUsd":1.01,"rentalDurationInDays":7,"watchingDurationInDays":3}]},"audienceType":"GENERAL","isVectorIndexingDone":true},{"id":44,"tenantId":100101118,"createdUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"modifiedUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"createdAt":"2025-10-28T12:57:56.403+00:00","updatedAt":"2025-11-24T11:22:29.390+00:00","publishStatus":"PUBLISHED","publishedBy":null,"asyncElasticSearch":true,"isDeletedBy":null,"isDeleted":false,"allowDownloads":true,"allowGuestUsersToWatch":true,"allowEarlyAccess":false,"maturityRating":"PG","maturityRatingTxtField":null,"listingCountryType":"BLACKLISTING_COUNTRIES","countries":[{"id":26,"name":"Argentina"}],"earlyAccessDate":"2025-01-01","vttUrl":"https://example.com/media/interstellar_test","contentStatus":"UNPUBLISHED","posterConversionStatus":"UNPUBLISHED","title":{"titleEn":"Adaraneeya Kathawak","titleSi":"Adaraneeya Kathawak","titleTa":"Adaraneeya Kathawak"},"slug":"adaraneeya_kathawak","description":"A celebrated singer and a village girl with a golden voice are torn apart by jealousy, betrayal, and fate. When love finally unites them, tragedy strikes—pushing him to make the ultimate sacrifice to secure her dream. Her greatest triumph comes with a heartbreaking discovery: true love lives beyond death.","releaseDate":"2016-06-10","runtime":"PT02H23M","publishDate":null,"unPublishDate":null,"director":[{"id":39,"name":"Priyantha Colambage","bio":"Priyantha Colombage is an award-winning Sri Lankan filmmaker best known for redefining Sinhala cinema with his debut feature Dehena (Trance) in 1998. At just 19, he became the youngest film director in Sri Lankan history. Dehena went on to win the highest number of awards for a Sri Lankan film that year and represented the country at the Tokyo International Film Festival.\n\nHis second film Vimukthi (Salvation) was selected unanimously by local critics to represent Sri Lanka at the Kerala, Milwelly and Cairo International Film Festivals, further establishing him as a bold, festival-driven storyteller. His third feature Arumosam Vehi (Fancy Rains) won Best Film at the 9th China International Children’s Film Festival in Ningbo (2007).\n\nColombage later founded Creative Force, a production company that became a major player in Sri Lankan television, advertising and documentary filmmaking. He has directed high-profile commercials for brands such as Unilever, Nestlé, Lion Breweries and Ceylinco, and produced several popular TV programs, including the political satire puppet show Jabos Lane and the educational children’s series Kekulu Yaya.\n\nHis filmography includes Adaraneeya Kathawak (2016), Dedunu Akase (2017), and two new 2024 releases, Mandara and Suriya Sulanga (currently in post-production). Across cinema, television and advertising, Colombage is recognised for visual storytelling rooted in emotion, psychology and human contradiction.\n\nKey highlights\n• Youngest film director in Sri Lankan cinema history\n• Multi-award winner, screened at Tokyo, Kerala, Cairo, Milwelly and Ningbo festivals\n• Acclaimed across feature films, commercials, children’s programming and satire\n• Known for cinematic realism, bold themes and festival-oriented narratives","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762498947231-Priyantha-Colambage.jpg","roleCommonResDTO":null}],"producer":[],"cast":[{"priorityNo":1,"castMemberCommonResDTO":{"id":39,"name":"Priyantha Colambage","bio":"Priyantha Colombage is an award-winning Sri Lankan filmmaker best known for redefining Sinhala cinema with his debut feature Dehena (Trance) in 1998. At just 19, he became the youngest film director in Sri Lankan history. Dehena went on to win the highest number of awards for a Sri Lankan film that year and represented the country at the Tokyo International Film Festival.\n\nHis second film Vimukthi (Salvation) was selected unanimously by local critics to represent Sri Lanka at the Kerala, Milwelly and Cairo International Film Festivals, further establishing him as a bold, festival-driven storyteller. His third feature Arumosam Vehi (Fancy Rains) won Best Film at the 9th China International Children’s Film Festival in Ningbo (2007).\n\nColombage later founded Creative Force, a production company that became a major player in Sri Lankan television, advertising and documentary filmmaking. He has directed high-profile commercials for brands such as Unilever, Nestlé, Lion Breweries and Ceylinco, and produced several popular TV programs, including the political satire puppet show Jabos Lane and the educational children’s series Kekulu Yaya.\n\nHis filmography includes Adaraneeya Kathawak (2016), Dedunu Akase (2017), and two new 2024 releases, Mandara and Suriya Sulanga (currently in post-production). Across cinema, television and advertising, Colombage is recognised for visual storytelling rooted in emotion, psychology and human contradiction.\n\nKey highlights\n• Youngest film director in Sri Lankan cinema history\n• Multi-award winner, screened at Tokyo, Kerala, Cairo, Milwelly and Ningbo festivals\n• Acclaimed across feature films, commercials, children’s programming and satire\n• Known for cinematic realism, bold themes and festival-oriented narratives","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762498947231-Priyantha-Colambage.jpg","roleCommonResDTO":null}},{"priorityNo":3,"castMemberCommonResDTO":{"id":24,"name":"Hemal Ranasinghe","bio":"Hemal Sachindra Ranasinghe is one of Sri Lanka’s most popular and versatile actors, admired for his charisma, talent, and ability to embody a wide range of characters on screen. Born in Matale in 1984, Hemal first gained international attention as a male model, winning Male Model of the World 2009 in Spain, before stepping into cinema. Since his debut in Super Six (2012), he has consistently held the spotlight in Sri Lankan cinema, winning multiple awards for Best Actor, Most Popular Actor, Youth Choice Actor, and Trend Setter.\n\nWith a strong presence in both commercial blockbusters and artistic films, Hemal is known for seamlessly blending action, romance, and drama. His background in martial arts and dance enhances his performances, giving him a unique physicality and on-screen energy. He has also extended his talent to television, both as an actor and a reality show judge. Today, Hemal is recognized as a leading figure of contemporary Sri Lankan cinema, with a career that continues to expand both locally and internationally.\n\nSignature Works on OTT\n\nSuper Six (2012) – Debut role, introducing him to cinema audiences\n\nPravegaya (2015) – Critically acclaimed, earned Jury and Popular awards\n\nAdaraneeya Kathawak (2016) – Romantic drama showcasing emotional depth\n\nZoom (2016) – Contemporary role blending technology and relationships\n\nBandhanaya (2017) – Historical-horror role as Jayasoma\n\nDedunu Akase (2017) – Romantic hit capturing mass audiences\n\nThaala (2019) – Role as Asela in a musical drama about identity and passion\n\nVijayaba Kollaya (2019) – Historical drama, nominated for Best Actor\n\nU Turn (2019) – As Inspector Ranga in the Sinhala remake of the Indian thriller\n\nColombo (2021) – Played Oscar in an urban crime drama\n\nKsheera Sagaraya Kalabina (2023) – Historical fantasy, nominated for Best Supporting Actor\n\nSihinayaki Adare (2024) – Contemporary romance as Rehan\n\n1970 Love Story (2024) – Retro romance as Raveen\n\nSihina Nelum Mal (2024) – Won Best Actor in a Leading Role\n\nIce Cream (2025) – Upcoming role as Dudu\n\nDevi Kusumasana (2025) – Historical portrayal of Konappu Bandara\n\nMaria (TBA) – Lead role Anthony, won international Best Actor award at HANIFF\n\nThe Wife, Maaya Bonchi (ElephantPass), Swans by the Sea, The Hidden City – Upcoming OTT-ready titles\n\nTelevision Roles\n\nEelangata Mokada Wenne (2014–2015) – Only teledrama role, won Best Supporting Actor at the Rupavahini State Awards.\n\nHosted Ayemath Adaren on Hiru TV.\n\nJudge on Hiru Super Dancer reality competition.\n\nAwards & Accolades\n\nDerana Film Awards – Most Popular Actor (2016, 2018), Critic Award (2016), Best Actor (2025).\n\nHiru Golden Film Awards – Most Promising Actor (2016), Trend Setter (2018).\n\nSarasaviya Awards – Jury Award (2016), Best Actor nominations for Pravegaya and Vijayaba Kollaya.\n\nPresidential Film Awards – Best Upcoming Actor (Pravegaya, 2017), Special Jury Award (2023).\n\nSLIM People’s Awards – Multiple wins as Actor of the Year and Youth Choice Actor (2018–2025).\n\nSignis Awards – Best Actor nomination for Adaraneeya Kathawak.\n\nHANIFF (Hanoi International Film Festival 2022) – Best Leading Actor (Maria).\n\nStyle & Impact\n\nHemal Ranasinghe is admired for:\n\nCharismatic on-screen presence and physical performance rooted in martial arts and modeling.\n\nBalancing mainstream popularity with award-winning performances.\n\nEstablishing himself as a consistent audience favorite across cinema and television.\n\nBringing contemporary star power while contributing to Sri Lanka’s growing international cinematic identity.\n\nVersatile Filmography: Action (Pravegaya), Romance (Dedunu Akase), Historical (Vijayaba Kollaya), Thriller (U Turn), and Fantasy (Ksheera Sagaraya Kalabina).\n\nCross-Market Appeal: International recognition through Maria positions him as a Sri Lankan actor with global potential.\n\nConsistent Popularity: His repeated wins in People’s Choice and Youth Awards prove his strong fan base, crucial for digital streaming traction.\n\nUpcoming Slate: With multiple projects set for release in 2025 and beyond, Hemal remains one of the most bankable OTT faces in Sri Lanka.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1761625758763-Cast_Member_Image_-_Hemal_Ranasinghe__800pX800p_.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":4,"castMemberCommonResDTO":{"id":40,"name":"Udari Warnakulasooriya","bio":"Actress · Model · TV Personality\nSri Lanka · Active since 2009\n\nUdari Warnakulasooriya is a leading Sri Lankan actress known for her breakout role as Sansala in the hit television drama Bonda Meedum, a performance that made her one of the most popular faces in Sinhala television. She later earned widespread acclaim for her role in Pini, securing multiple Best Actress and Most Popular Actress awards across major local platforms, including the Sumathi Awards, Raigam Tele’es and Derana Film Awards.\n\nBorn in Negombo, Udari began her career in modelling, becoming a finalist at Miss Sri Lanka for Miss World 2007, where she won several special titles including Miss Talent, Miss Popular and Beautiful Legs. In 2015, she was crowned Mrs. Sri Lanka for Mrs. Globe, winning additional titles for Elegance, Skin and Popularity.\n\nBefore entering acting, she appeared in high-profile commercials and music videos, later making her film debut at age 21 in Paya Enna Hiru Se. Since then, she has worked across cinema, television and presenting, including roles in Adaraneeya Kathawak, Porisadaya, Midunu Vishwaya, Ksheera Sagaraya Kalabina, and the upcoming Devi Kusumasana.\n\nDuring the COVID-19 lockdown period, she completed filming for eight major feature films, confirming her status as one of the industry’s most in-demand performers.\n\nCareer highlights\n• Most Popular Actress – Sumathi Awards, Derana, Raigam Tele’es\n• Starred in top-rated TV dramas including Bonda Meedum and Sansaranya Asabada\n• Crowned Mrs. Sri Lanka for Mrs. Globe 2015\n• Known for versatile roles in romance, historical drama, and psychological thrillers\n• Strong dual career in cinema and television, with multiple unreleased feature films in pipeline\n\nSignature roles\nSansala (Bonda Meedum)\nPiyavi Hansika (Adaraneeya Kathawak)\nSedera Menike (Eka Gei Sokari)\nRajini Madirakshi (Midunu Vishwaya)\nPurambhikawa (Ksheera Sagaraya Kalabina)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499076618-Udari-Warnakulasooriya.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":5,"castMemberCommonResDTO":{"id":41,"name":"Bimal Jayakody","bio":"Actor · Performer · Producer\nSri Lanka · Active since 1990s\n\nBimal Jayakody is one of Sri Lankan cinema and television’s most versatile character actors, celebrated for emotionally intense roles and critically acclaimed performances across film, TV and theatre. Known for his ability to shift between heroic, tragic and antagonist roles, he has earned multiple Best Actor awards and festival nominations for films such as Gamani, Sakkarang and Dekala Purudu Kenek.\n\nBorn into a family deeply rooted in the performing arts, Bimal entered the industry as a TV technician before transitioning into acting. His extended family includes several iconic Sri Lankan actresses, including Geetha Kanthi Jayakody and Rathna Lalani, making him part of one of the country’s most respected acting dynasties.\n\nHe made his film debut in 2006 with Ali Patiyo Oyai Mamai and went on to work in landmark productions including Aba, Siri Parakum, Bambara Walalla, Paya Enna Hiru Se, U Turn, Tsunami, Kawuruth Danne Na, and the internationally acclaimed Dekala Purudu Kenek, for which he won Best Actor at the Sarasaviya Awards.\n\nOn television, he has starred in more than 60 series, including Sanakeliyay Maya, Pabalu, Raahu, Deweni Inima, Pani Makuluwo, Veeduru Mal and Sihina Aran Enna, earning wide recognition as a dramatic lead and anti-hero figure. He also released a single, Oba Aye Dawasaka, in 2014, showcasing his parallel music career.\n\nAmong his upcoming film roles are major performances in Rani (as Mahinda Rajapaksa), Mandara, Mother Lanka and several unreleased titles in production, confirming his continued relevance in modern Sri Lankan cinema.\n\nCareer Highlights\n• Multiple Best Actor wins including Raigam Tele’es and Sarasaviya Awards\n• Acclaimed for roles in Gamani, Sakkarang and Dekala Purudu Kenek\n• Known for intense, layered portrayals in serious drama and psychological conflict\n• Actor from a legendary Sri Lankan artistic family lineage\n• Over three decades of work across film, television, theatre and music\n\nSignature roles\nMajor Vikum (Gamani)\nSube (Sakkarang)\nSachithra (Dekala Purudu Kenek)\nInspector Wikrama (Kawuruth Danne Na)\nUvindu (Adaraneeya Kathawak)\nClifford Dunuwila (1970 Love Story)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499170543-Bimal-Jayakody.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":6,"castMemberCommonResDTO":{"id":42,"name":"Suranga Ranawaka","bio":"Actor · Director · Screenwriter\nSri Lanka · Active since 2010\n\nSuranga Ranawaka is a Sri Lankan actor and filmmaker best known for his performances in the critically acclaimed war drama Alimankada (2010), the psychological thriller Dirty, Yellow, Darkness (2015), and the 2022 feature Happy Birthday. With a screen presence rooted in realism and emotional restraint, he is recognized for portraying conflicted, complex characters in dark, character-driven cinema.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499280294-Suranga-Ranawaka.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":7,"castMemberCommonResDTO":{"id":43,"name":"Aruni Rajapaksha","bio":"Actress · Model · TV Host · Beauty Queen\nSri Lanka · Active since 2004\n\nAruni Rajapaksha is a Sri Lankan actress, model and television host who entered the public spotlight after winning two major pageant titles — Udarata Menike 2004 and Capri Beauty Queen 2005. She later moved into acting, television presenting and brand work, becoming a familiar face across cinema, fashion and entertainment media in Sri Lanka.\n\nShe made her film debut in Super Six (2012) as the lead actress, followed by key roles in historical, dramatic and musical films such as Maharaja Gemunu, Address Na, Paththini and Adaraneeya Kathawak. Known for her elegant screen presence, she has appeared in both commercial and period cinema, often portraying graceful, poised and strong female characters.\n\nAlongside acting, Aruni has hosted several popular lifestyle and talk shows including Hello Sri Lanka and Liyasevana, extending her career into television presenting and live entertainment.\n\nCareer highlights\n• Crowned Udarata Menike (2004) & Capri Beauty Queen (2005)\n• Lead actress in Super Six and featured in Maharaja Gemunu, Paththini and Adaraneeya Kathawak\n• TV host for multiple programmes on mainstream Sri Lankan television\n• Fashion model with national recognition before entering film\n\nPersonal\nBorn in Kalpitiya and raised in Kandy, Aruni transitioned from technical studies to modelling before entering pageantry. She is married to Nalin Samarawickrama and is the mother of twin daughters.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499310694-Aruni-Rajapaksha.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":8,"castMemberCommonResDTO":{"id":44,"name":"Maureen Charuni","bio":"Actress · Director · Veteran Performer\nSri Lanka · Active since 1984\n\nMaureen Charuni is a highly respected Sri Lankan actress known for her long-standing contribution to cinema, theatre and television. With a career spanning four decades, she is recognised as one of the country’s most versatile dramatic performers, especially celebrated for her emotional depth in motherly and family-centric roles. She has become a familiar and beloved presence in Sri Lankan households through some of the most successful and long-running TV serials in the country’s history.\n\nBorn in Kurunegala and named after Hollywood star Maureen O’Hara, Charuni entered the industry despite early family opposition, making her cinematic debut in Karadiya Walalla. She later rose to national fame with her performance as Nanda in the iconic teledrama Gamperaliya, followed by major roles in works such as Paba, Sara, Sandagalathenna, Teacher Amma, Aliya, Golu Muhude Kunatuwak and Panamankkada.\n\nIn addition to her acting career, she directed the film Hansa Vilapaya in 2000, further solidifying her creative range beyond performance.\n\nMaureen Charuni is widely regarded as a dramatic cornerstone of Sri Lankan television, often cast in emotionally strong, graceful, resilient mother figures that transcend generational storytelling.\n\nCareer highlights\n• Over 150+ acting credits across film, theatre and television\n• Known for iconic performances in Gamperaliya, Thunkal Sihinaya and Maya\n• One of Sri Lanka’s most consistent and recognisable character actresses\n• Director of the feature film Hansa Vilapaya\n• Frequently cast in leading mother roles in major film releases for over 30 years\n\nPersonal\nA qualified sitar player and English teacher before entering cinema, Charuni is married to tourism professional Gihan Ranjith Imbulana and is the mother of one daughter.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499462016-Morin_Charuni.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":9,"castMemberCommonResDTO":{"id":47,"name":"Anjalee Liyanage","bio":"Actress · Performer · Public Personality\nSri Lanka · Active in film & television\n\nAnjali Liyanage is a Sri Lankan actress known for her versatile range and captivating on-screen presence. Over the years, she has earned recognition as a reliable and expressive performer, taking on roles that span drama, romance, comedy and family storytelling. Her natural screen charisma and emotional depth have made her a familiar face in both television and cinema.\n\nBeyond acting, Anjali maintains an active digital presence, connecting with audiences through her official social media channels. She uses Instagram (@sl_anjalee_liyanage) to share behind-the-scenes moments, lifestyle posts, production updates and direct interaction with fans, while her Twitter feed highlights industry news and upcoming projects.\n\nHer official website features a detailed biography, portfolio gallery, featured video clips and announcements, showcasing her multi-layered career and ongoing work in the entertainment industry.\n\nRecognised for\n• Strong emotional performances across multiple genres\n• Consistent presence in Sri Lankan entertainment\n• Active engagement with audiences across social platforms","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499694273-Anjali_Liyanage_800pX800p.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":2,"castMemberCommonResDTO":{"id":39,"name":"Priyantha Colambage","bio":"Priyantha Colombage is an award-winning Sri Lankan filmmaker best known for redefining Sinhala cinema with his debut feature Dehena (Trance) in 1998. At just 19, he became the youngest film director in Sri Lankan history. Dehena went on to win the highest number of awards for a Sri Lankan film that year and represented the country at the Tokyo International Film Festival.\n\nHis second film Vimukthi (Salvation) was selected unanimously by local critics to represent Sri Lanka at the Kerala, Milwelly and Cairo International Film Festivals, further establishing him as a bold, festival-driven storyteller. His third feature Arumosam Vehi (Fancy Rains) won Best Film at the 9th China International Children’s Film Festival in Ningbo (2007).\n\nColombage later founded Creative Force, a production company that became a major player in Sri Lankan television, advertising and documentary filmmaking. He has directed high-profile commercials for brands such as Unilever, Nestlé, Lion Breweries and Ceylinco, and produced several popular TV programs, including the political satire puppet show Jabos Lane and the educational children’s series Kekulu Yaya.\n\nHis filmography includes Adaraneeya Kathawak (2016), Dedunu Akase (2017), and two new 2024 releases, Mandara and Suriya Sulanga (currently in post-production). Across cinema, television and advertising, Colombage is recognised for visual storytelling rooted in emotion, psychology and human contradiction.\n\nKey highlights\n• Youngest film director in Sri Lankan cinema history\n• Multi-award winner, screened at Tokyo, Kerala, Cairo, Milwelly and Ningbo festivals\n• Acclaimed across feature films, commercials, children’s programming and satire\n• Known for cinematic realism, bold themes and festival-oriented narratives","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762498947231-Priyantha-Colambage.jpg","roleCommonResDTO":null}}],"subtitles":[{"language":"English","url":"https://dyp5fjwik91fw.cloudfront.net/lms/srt/1762759078117-Sinners.2025.1080p.WEBRip.x264.AAC5.1-_YTS.MX_.srt"}],"genres":[{"genreId":28,"genreName":"Drama"},{"genreId":30,"genreName":"Romance"},{"genreId":34,"genreName":"Musical"}],"keywords":[{"keywordId":17,"keywordName":"Romance"},{"keywordId":23,"keywordName":"Movie"},{"keywordId":24,"keywordName":"Family"}],"video":{"id":69,"title":"Adaraneeya Kathawak mp4","resolutions":"[\"1080p\",\"720p\",\"360p\",\"240p\"]","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/adaraneeya_kathawak/video/hls/02-Dec-20-122141_adaraneeyakathawak.m3u8","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/adaraneeya_kathawak/video/hls/02-Dec-20-122141_adaraneeyakathawak.m3u8","conversionStatus":"COMPLETE","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"posters":[{"id":713,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656251578-adharaneya_kathawak_without_titel_Web_1920X1080.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656251578-adharaneya_kathawak_without_titel_Web_1920X1080.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":714,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"BACKGROUND_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656252974-adharaneya_kathawak_without_titel_Web_1920X1080.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656252974-adharaneya_kathawak_without_titel_Web_1920X1080.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":715,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656254246-adharaneya_kathawak_with_titel_Web_1920X1080.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656254246-adharaneya_kathawak_with_titel_Web_1920X1080.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":716,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656256094-adharaneya_kathawak_titel.png","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656256094-adharaneya_kathawak_titel.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":717,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656258060-adharaneya_kathawak_Web_tumb_port_with_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656258060-adharaneya_kathawak_Web_tumb_port_with_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":718,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761656259323-adharaneya_kathawak_Web_tumb_port_without_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761656259323-adharaneya_kathawak_Web_tumb_port_without_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":963,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763983306963-adharaneya_kathawak_Web_tumb_port_with_titel02.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763983306963-adharaneya_kathawak_Web_tumb_port_with_titel02.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":964,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763983310451-adharaneya_kathawak_Web_tumb_port_without_titel02.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763983310451-adharaneya_kathawak_Web_tumb_port_without_titel02.webp","posterOrientation":"PORTRAIT","posterType":"WEB"}],"mediaTrailer":{"id":112,"title":"Adaraneeya Kathawak Trailer","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1763719533484-Adaraneeya Kathawak Trailer.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1763719533484-Adaraneeya%20Kathawak%20Trailer/master.m3u8","conversionStatus":"TRANSCODED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"monetization":{"freeClientPackage":[5],"advertisingAllowed":false,"payToWatchPackageDTOS":[{"payToWatchClientPackageId":2,"priceLkr":700.0,"priceUsd":2.0,"rentalDurationInDays":7,"watchingDurationInDays":3}]},"audienceType":"GENERAL","isVectorIndexingDone":false},{"id":42,"tenantId":100101118,"createdUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"modifiedUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"createdAt":"2025-10-28T12:51:13.250+00:00","updatedAt":"2025-11-25T07:54:06.392+00:00","publishStatus":"PUBLISHED","publishedBy":null,"asyncElasticSearch":true,"isDeletedBy":null,"isDeleted":false,"allowDownloads":true,"allowGuestUsersToWatch":true,"allowEarlyAccess":false,"maturityRating":"PG","maturityRatingTxtField":null,"listingCountryType":"BLACKLISTING_COUNTRIES","countries":[{"id":26,"name":"Argentina"}],"earlyAccessDate":"2025-01-01","vttUrl":"https://example.com/media/interstellar_test","contentStatus":"UNPUBLISHED","posterConversionStatus":"UNPUBLISHED","title":{"titleEn":"Address Na","titleSi":"Address Na","titleTa":"Address Na"},"slug":"address_na","description":"When a ruthless gangster exploits the poor under a wealthy man’s cover, a deaf beggar and his devoted daughter are dragged into a deadly web of crime, betrayal, and hidden family ties. As murder, mistaken identity, and shocking truths collide, only love and truth can bring redemption.","releaseDate":"2015-10-23","runtime":"PT02H01M","publishDate":null,"unPublishDate":null,"director":[{"id":48,"name":"Jackson Anthony","bio":"Actor · Director · Writer · Cultural Icon\nSri Lanka · 1958 – 2023\n\nJackson Anthony was one of the greatest and most decorated actors in Sri Lankan cinema, theatre and television, widely honoured as “Sakala Kala Sakwithi” — the King of All Arts. With a career spanning four decades, he redefined the Sri Lankan screen and stage with his unmatched versatility, powerful character work and record-breaking 16 Best Actor awards.\n\nCelebrated for landmark performances in Bawa Duka, Bawa Karma, Sooriya Arana, Aswesuma, Mille Soya and Gini Avi Saha Gini Keli, he moved across drama, history, folklore, thriller and spiritual cinema with equal mastery. His presence extended far beyond acting — he was also a director, screenwriter, lyricist, novelist, historian, presenter, singer and explorer, commanding every medium he stepped into.\n\nAs a director, he made some of the most ambitious Sri Lankan films ever produced, including Aba and Address Na. His teledramas like Daskon and See Raja won multiple awards for writing and direction, setting new standards for historical television storytelling.\n\nJackson Anthony was also a beloved host, documentary traveller and cultural educator, known for shows such as Maha Sinhalaye Vansa Kathawa, Ganga Dige, and Roma Puranaya, blending history, spirituality and national identity.\n\nHis legacy lives through an unparalleled body of work, a generation of actors he influenced, and his three children who all followed him into the arts.\n\nLegacy highlights\n• Widely regarded as the greatest dramatic actor in Sinhala cinema\n• Winner of 16 Best Actor awards — a national record\n• Actor, director, presenter, historian, lyricist and cultural educator\n• Star of Bawa Duka, Sooriya Arana, Mille Soya, Aswesuma\n• Directed major films including Aba, Julietge Bhumikawa and Address Na\n• Presenter of landmark travel & heritage programs watched by millions\n\nRemembered as\nA multi-disciplinary artist, a scholar in performance, and a national cultural figure whose work transformed Sri Lankan storytelling across every medium.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762503018452-Jackson_Anthony.jpg","roleCommonResDTO":null}],"producer":[],"cast":[{"priorityNo":1,"castMemberCommonResDTO":{"id":48,"name":"Jackson Anthony","bio":"Actor · Director · Writer · Cultural Icon\nSri Lanka · 1958 – 2023\n\nJackson Anthony was one of the greatest and most decorated actors in Sri Lankan cinema, theatre and television, widely honoured as “Sakala Kala Sakwithi” — the King of All Arts. With a career spanning four decades, he redefined the Sri Lankan screen and stage with his unmatched versatility, powerful character work and record-breaking 16 Best Actor awards.\n\nCelebrated for landmark performances in Bawa Duka, Bawa Karma, Sooriya Arana, Aswesuma, Mille Soya and Gini Avi Saha Gini Keli, he moved across drama, history, folklore, thriller and spiritual cinema with equal mastery. His presence extended far beyond acting — he was also a director, screenwriter, lyricist, novelist, historian, presenter, singer and explorer, commanding every medium he stepped into.\n\nAs a director, he made some of the most ambitious Sri Lankan films ever produced, including Aba and Address Na. His teledramas like Daskon and See Raja won multiple awards for writing and direction, setting new standards for historical television storytelling.\n\nJackson Anthony was also a beloved host, documentary traveller and cultural educator, known for shows such as Maha Sinhalaye Vansa Kathawa, Ganga Dige, and Roma Puranaya, blending history, spirituality and national identity.\n\nHis legacy lives through an unparalleled body of work, a generation of actors he influenced, and his three children who all followed him into the arts.\n\nLegacy highlights\n• Widely regarded as the greatest dramatic actor in Sinhala cinema\n• Winner of 16 Best Actor awards — a national record\n• Actor, director, presenter, historian, lyricist and cultural educator\n• Star of Bawa Duka, Sooriya Arana, Mille Soya, Aswesuma\n• Directed major films including Aba, Julietge Bhumikawa and Address Na\n• Presenter of landmark travel & heritage programs watched by millions\n\nRemembered as\nA multi-disciplinary artist, a scholar in performance, and a national cultural figure whose work transformed Sri Lankan storytelling across every medium.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762503018452-Jackson_Anthony.jpg","roleCommonResDTO":{"roleId":6,"roleName":"Director / Actor"}}},{"priorityNo":2,"castMemberCommonResDTO":{"id":49,"name":"Janitha Marasinghe","bio":"Actor · Television & Film Performer\nSri Lanka · Active since early 2000s\n\nJanitha Marasinghe is a Sri Lankan actor known for his appearances in film and television, most recognised for his roles in the drama Le Kiri Kandulu (2003), the family adventure sequel Ran Kewita 2 (2013) and the political satire film Jayasri Amathithuma (2019). With a screen presence rooted in relatable, grounded character portrayals, he has been part of productions that blend emotional storytelling with social themes.\n\nActive across different genres, Janitha has worked in both mainstream and character-driven roles, earning recognition for subtle, naturalistic acting rather than theatrics. His on-screen work includes drama, comedy and socially reflective cinema, contributing to a growing career in Sri Lankan film.\n\nKnown for\n• Le Kiri Kandulu – Drama (2003)\n• Ran Kewita 2 – Family/Adventure (2013)\n• Jayasri Amathithuma – Satire/Comedy (2019)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762503709148-Janitha-Marasinghe.jpg","roleCommonResDTO":null}},{"priorityNo":4,"castMemberCommonResDTO":{"id":50,"name":"Sabeetha Perera","bio":"Actress · Sri Lankan & Pakistani Cinema Icon\nSri Lanka / Pakistan · Active since 1967\n\nSabeetha Perera is one of the most successful and influential actresses in Sri Lankan cinema, dominating the 1980s and 1990s as the undisputed female superstar of the era. Known for her expressive performances, screen glamour and ability to carry both commercial and artistic films, she built a cross-border legacy as a major star in both Sinhala cinema and Pakistan’s Lollywood industry.\n\nBorn on 1 December 1962 to legendary Sri Lankan film couple Anthony Stanley Perera (director/actor) and Girley Gunawardana (actress), Sabeetha entered cinema at age three, appearing in her parents’ films Iwasana Dana and Hathara Kendare. Her breakthrough as an adult came with Rosy, leading to her first Pakistani film Sadaakal Randeva — released in Urdu as Kabi Al Vidana Kena, a blockbuster in both countries. She went on to star in 17 Urdu films, including Nadiya, Zameen Aur Aasman, Donkaraya, Sabke Baap and Aagh Hi Aagh, earning Best Actress at the Alsakar Film Festival and multiple Pakistani awards including the popular Bobby title and the Al-Shakar Award.\n\nIn Sri Lanka, she delivered some of the most iconic female roles in Sinhala cinema, winning Best Actress at the Sarasaviya Awards (1985) for Deveni Gamana and receiving further acclaim for Viragaya (as Bathee) and Sisila Gini Gani (as Annette) — still considered two of the finest female performances ever recorded in Sinhala film.\n\nAcross a career spanning five decades, she has acted in over 100 films across Sinhala, Urdu, Tamil and English, including Bangali Walalu, Sakvithi Suwaya, Viragaya, Chandi Raja, Cheriyo Doctor, Oba Koheda Priye, Aba and Address Na. She also appeared in popular teledramas such as Ran Kahawanu, Pitagamkarayo and Akala Sandya, and in the stage play Age Nama Rathi.\n\nSabeetha has received Sarasaviya, OCIC, Presidential and Swarna Shanka Awards, along with a Special Award from the Pakistan Film Corporation for international contribution to cinema.\n\nMarried to businessman Upali Jayasinghe, she remains a celebrated cultural icon whose career bridged two film nations.\n\nKnown for\n• One of Sri Lanka’s biggest female superstars of the ’80s–’90s\n• Acted in 17 Urdu films, making her a rare Sri Lankan crossover star\n• Award-winning performances in Deveni Gamana, Viragaya and Sisila Gini Gani\n• Winner of Best Actress awards in both Sri Lanka and Pakistan","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762503844215-Sabeetha_Perera_800pX800p-Recovered.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":6,"castMemberCommonResDTO":{"id":51,"name":"Sheshadrie Priyasad","bio":"Actress · TV Presenter · Former Child Star\nSri Lanka · Active since 1997\n\nSheshadrie Priyasad is a Sri Lankan actress and television presenter who began her career as a child artist and grew into one of the familiar young faces in modern Sinhala cinema and TV entertainment. Born into a celebrated film family, she is the second daughter of veteran director and producer Dinesh Priyasad, and part of the well-known “Priyasad sisters” trio, alongside actresses Dinakshie and Shanudrie.\n\nShe made her screen debut at the age of four in her father’s film Apaye Thathpara Asu Haradahak (1997) and first gained public recognition as a child TV host in the Sirasa TV program Punchi Panchi. Her first major lead role as an adult came in the 2011 youth film Challenges (Yawwanaye Babaru Api), followed by performances in Senasuru Maruwa, Double Trouble, Address Na and Zoom.\n\nFor her performance in Zoom, she received a Merit Award at the 34th Sarasaviya Awards (2016) and was also nominated for Best Upcoming Actress the same year. She continues to work in both commercial and youth-oriented cinema, recently starring in Weerya (2024) and Sihinayaki Adare (2024), with several unreleased productions in the pipeline.\n\nRaised and educated at Holy Family Convent, Bambalapitiya, Sheshadrie is known not only for her film work but also for her presence as a presenter, particularly connected to children's and lifestyle television formats.\n\nKnown for\n• Early child roles and transition into leading actress\n• Starring in Challenges, Address Na, Zoom and Weerya\n• Member of Sri Lanka’s most famous acting sibling trio\n• Active in film, TV hosting and youth entertainment culture","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504140974-Sheshadrie-Priyasad.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":7,"castMemberCommonResDTO":{"id":52,"name":"Kamal Addararachchi","bio":"Actor · Singer · Presenter · Theatre Performer\nSri Lanka · Active since 1981\n\nKamal Addararachchi is one of the most recognisable actors in Sri Lankan cinema, theatre and television, known for his intense screen presence, dramatic range and iconic performances across four decades. He made his film debut while still in school, appearing in Gamini Fonseka’s Sagarayak Meda (1981), and went on to become a leading figure in Sinhala cinema through landmark roles in Saptha Kanya, Agnidahaya, Sewwandi, Mille Soya, Gharasarapa and Ginnen Upan Seethala.\n\nA graduate of Wesley College, Colombo, Kamal was active in music, literature and Kandyan dance in his youth, later moving into stage plays, teledramas and film. His breakout performance came with Saptha Kanya (1993), followed by his award-winning role as Sobana in Agnidahaya, which earned him the Sarasaviya Best Actor Award (2002). He has since acted in more than 40 films, 20 teledramas and six major stage productions.\n\nIn television, Kamal became a household name not only as an actor but also as the original host of the hit reality series Sirasa Superstar (seasons 1–3) and later Hiru Mega Stars, solidifying his crossover appeal to younger generations.\n\nHe is also a playback and pop singer, first entering the music scene with the widely popular duet “Unmadawoo” (1993), still considered one of the most memorable love songs in Sinhala cinema.\n\nCareer highlights\n• More than 40 feature films and 20+ teledramas since the 1980s\n• Winner of Sarasaviya Best Actor, Presidential Award, Sumathi Awards\n• Known for Saptha Kanya, Agnidahaya, Mille Soya, Randiya Dahara, Gharasarapa\n• Host of Sri Lanka’s most-watched talent show Sirasa Superstar\n• Actor, singer, TV presenter and respected theatre performer\n\nSignificant roles\nAkhil Ruwanwalla (Saptha Kanya)\nSobana (Agnidahaya)\nCaptain Samantha Weerasuriya (Randiya Dahara)\nSandeares Edirisinghe (Gharasarapa)\nRohana Wijeweera (Ginnen Upan Seethala)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504229254-Kamal_Addaraarachchi_800pX800p-Recovered.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":8,"castMemberCommonResDTO":{"id":53,"name":"Mahendra Perera","bio":"Actor · Stage Performer · Art Director\nSri Lanka · Active since 1978\n\nMahendra Perera is one of the most influential and versatile actors in Sri Lankan cinema, equally acclaimed for his dramatic depth and comedic timing. With a career spanning over four decades, he has appeared in more than 70 films, numerous television serials and multiple stage productions — becoming a defining screen presence in Sinhala cinema.\n\nBorn in Mount Lavinia, Mahendra began exploring music and performance while still in school, later training under legendary theatre masters including Dhamma Jagoda, Dr. Solomon Fonseka and Tony Ranasinghe. His rise began with Sakwithi Suwaya (1978) and Sagarayak Meda (1981), leading to standout roles in landmark films such as Aswesuma, Mille Soya, Bahubuthayo, Kosthapal Punyasoma, Sulanga Enu Pinisa, 28, Gindari and Address Na.\n\nKnown for shifting effortlessly between hero, villain, comic relief and character roles, he is one of the few actors to maintain equal success in film, TV and stage. He also worked behind the camera as art director (Julietge Bhumikawa, Pawuru Walalu) and assistant director (Koti Waligaya).\n\nCareer highlights\n• 40+ years in cinema, theatre and television\n• Known for Aswesuma, Bahubuthayo, Mille Soya, Kosthapal Punyasoma, 28\n• Award-winning actor at the Sarasaviya Awards and Presidential Film Awards\n• Frequently cast by directors Sumitra Peries, Vasantha Obeysekera, Udayakantha Warnasuriya and Jayantha Chandrasiri\n• Notable for unforgettable comedic characters like Lanty in Bahubuthayo and Gindari\n\nSignature roles\nBerty Malli (Sakwithi Suwaya)\nSammy (Gini Avi Saha Gini Keli)\nLanty (Bahubuthayo / Gindari)\nKulatunga (Randiya Dahara)\nAbasiri (28)\nWilson (Kathuru Mithuru)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504364702-Mahendra-Perera.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":9,"castMemberCommonResDTO":{"id":24,"name":"Hemal Ranasinghe","bio":"Hemal Sachindra Ranasinghe is one of Sri Lanka’s most popular and versatile actors, admired for his charisma, talent, and ability to embody a wide range of characters on screen. Born in Matale in 1984, Hemal first gained international attention as a male model, winning Male Model of the World 2009 in Spain, before stepping into cinema. Since his debut in Super Six (2012), he has consistently held the spotlight in Sri Lankan cinema, winning multiple awards for Best Actor, Most Popular Actor, Youth Choice Actor, and Trend Setter.\n\nWith a strong presence in both commercial blockbusters and artistic films, Hemal is known for seamlessly blending action, romance, and drama. His background in martial arts and dance enhances his performances, giving him a unique physicality and on-screen energy. He has also extended his talent to television, both as an actor and a reality show judge. Today, Hemal is recognized as a leading figure of contemporary Sri Lankan cinema, with a career that continues to expand both locally and internationally.\n\nSignature Works on OTT\n\nSuper Six (2012) – Debut role, introducing him to cinema audiences\n\nPravegaya (2015) – Critically acclaimed, earned Jury and Popular awards\n\nAdaraneeya Kathawak (2016) – Romantic drama showcasing emotional depth\n\nZoom (2016) – Contemporary role blending technology and relationships\n\nBandhanaya (2017) – Historical-horror role as Jayasoma\n\nDedunu Akase (2017) – Romantic hit capturing mass audiences\n\nThaala (2019) – Role as Asela in a musical drama about identity and passion\n\nVijayaba Kollaya (2019) – Historical drama, nominated for Best Actor\n\nU Turn (2019) – As Inspector Ranga in the Sinhala remake of the Indian thriller\n\nColombo (2021) – Played Oscar in an urban crime drama\n\nKsheera Sagaraya Kalabina (2023) – Historical fantasy, nominated for Best Supporting Actor\n\nSihinayaki Adare (2024) – Contemporary romance as Rehan\n\n1970 Love Story (2024) – Retro romance as Raveen\n\nSihina Nelum Mal (2024) – Won Best Actor in a Leading Role\n\nIce Cream (2025) – Upcoming role as Dudu\n\nDevi Kusumasana (2025) – Historical portrayal of Konappu Bandara\n\nMaria (TBA) – Lead role Anthony, won international Best Actor award at HANIFF\n\nThe Wife, Maaya Bonchi (ElephantPass), Swans by the Sea, The Hidden City – Upcoming OTT-ready titles\n\nTelevision Roles\n\nEelangata Mokada Wenne (2014–2015) – Only teledrama role, won Best Supporting Actor at the Rupavahini State Awards.\n\nHosted Ayemath Adaren on Hiru TV.\n\nJudge on Hiru Super Dancer reality competition.\n\nAwards & Accolades\n\nDerana Film Awards – Most Popular Actor (2016, 2018), Critic Award (2016), Best Actor (2025).\n\nHiru Golden Film Awards – Most Promising Actor (2016), Trend Setter (2018).\n\nSarasaviya Awards – Jury Award (2016), Best Actor nominations for Pravegaya and Vijayaba Kollaya.\n\nPresidential Film Awards – Best Upcoming Actor (Pravegaya, 2017), Special Jury Award (2023).\n\nSLIM People’s Awards – Multiple wins as Actor of the Year and Youth Choice Actor (2018–2025).\n\nSignis Awards – Best Actor nomination for Adaraneeya Kathawak.\n\nHANIFF (Hanoi International Film Festival 2022) – Best Leading Actor (Maria).\n\nStyle & Impact\n\nHemal Ranasinghe is admired for:\n\nCharismatic on-screen presence and physical performance rooted in martial arts and modeling.\n\nBalancing mainstream popularity with award-winning performances.\n\nEstablishing himself as a consistent audience favorite across cinema and television.\n\nBringing contemporary star power while contributing to Sri Lanka’s growing international cinematic identity.\n\nVersatile Filmography: Action (Pravegaya), Romance (Dedunu Akase), Historical (Vijayaba Kollaya), Thriller (U Turn), and Fantasy (Ksheera Sagaraya Kalabina).\n\nCross-Market Appeal: International recognition through Maria positions him as a Sri Lankan actor with global potential.\n\nConsistent Popularity: His repeated wins in People’s Choice and Youth Awards prove his strong fan base, crucial for digital streaming traction.\n\nUpcoming Slate: With multiple projects set for release in 2025 and beyond, Hemal remains one of the most bankable OTT faces in Sri Lanka.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1761625758763-Cast_Member_Image_-_Hemal_Ranasinghe__800pX800p_.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":10,"castMemberCommonResDTO":{"id":54,"name":"Madhavee Wathsala Anthony","bio":"Actress · Singer · TV Host · Dancer\nSri Lanka · Active since 1994\n\nMadhavee Wathsala Anthony is a multifaceted Sri Lankan performer who entered the industry as a child star through the iconic musical program Hapan Padura and went on to build a career that spans acting, singing, television hosting, music videos, documentaries, and live performance. She is the eldest daughter of legendary actor-director Jackson Anthony and singer-actress Kumari Munasinghe, and is widely recognized as one of the strongest second-generation talents in Sri Lankan entertainment.\n\nA graduate in Archaeology from the University of Kelaniya, Madhavee balances academic depth with artistic range. She has starred in critically acclaimed television dramas including Daskon, See Raja, Pali, Mahaviru Pandu, Thaadi, Amalia and Chandi Kumarihami, earning awards for both acting and playback singing. Her breakthrough in cinema came with the film Address Na, where she appeared opposite her father under his direction.\n\nAs a singer, she has recorded hit singles such as Oba Epa, Piyambamee, Raththarane, and Adare Onakere, in addition to performing theme songs for multiple television series. She is also a presenter on Hiru TV and a former child radio host on SLBC and Savana FM.\n\nCareer highlights\n• Debuted at age 6; trained in music, dance & screen performance\n• Known for roles in Daskon, See Raja, Pali, Mahaviru Pandu, Thaadi\n• Best Upcoming Actress – Raigam Tele'es\n• Merit Awards – Sumathi Awards & National Tele Awards\n• Featured in the Raffealla Fernando Celebrity Calendar (2021)\n• Playback singer for Eka Gei Sokari and multiple teledrama themes\n• Former curator & researcher at Sigiriya Museum and SAARC Cultural Centre\n• Lecturer in Tourism & Hospitality (MSU)\n\nSignature screen roles\nPalingu Achchi (Daskon)\nSubhadra (See Raja)\nPramuditha (Amalia)\nMadara (Thaadi)\nJanaki (Address Na)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504440856-Madhavee_Wathsala_Anthony_800pX800p.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":11,"castMemberCommonResDTO":{"id":41,"name":"Bimal Jayakody","bio":"Actor · Performer · Producer\nSri Lanka · Active since 1990s\n\nBimal Jayakody is one of Sri Lankan cinema and television’s most versatile character actors, celebrated for emotionally intense roles and critically acclaimed performances across film, TV and theatre. Known for his ability to shift between heroic, tragic and antagonist roles, he has earned multiple Best Actor awards and festival nominations for films such as Gamani, Sakkarang and Dekala Purudu Kenek.\n\nBorn into a family deeply rooted in the performing arts, Bimal entered the industry as a TV technician before transitioning into acting. His extended family includes several iconic Sri Lankan actresses, including Geetha Kanthi Jayakody and Rathna Lalani, making him part of one of the country’s most respected acting dynasties.\n\nHe made his film debut in 2006 with Ali Patiyo Oyai Mamai and went on to work in landmark productions including Aba, Siri Parakum, Bambara Walalla, Paya Enna Hiru Se, U Turn, Tsunami, Kawuruth Danne Na, and the internationally acclaimed Dekala Purudu Kenek, for which he won Best Actor at the Sarasaviya Awards.\n\nOn television, he has starred in more than 60 series, including Sanakeliyay Maya, Pabalu, Raahu, Deweni Inima, Pani Makuluwo, Veeduru Mal and Sihina Aran Enna, earning wide recognition as a dramatic lead and anti-hero figure. He also released a single, Oba Aye Dawasaka, in 2014, showcasing his parallel music career.\n\nAmong his upcoming film roles are major performances in Rani (as Mahinda Rajapaksa), Mandara, Mother Lanka and several unreleased titles in production, confirming his continued relevance in modern Sri Lankan cinema.\n\nCareer Highlights\n• Multiple Best Actor wins including Raigam Tele’es and Sarasaviya Awards\n• Acclaimed for roles in Gamani, Sakkarang and Dekala Purudu Kenek\n• Known for intense, layered portrayals in serious drama and psychological conflict\n• Actor from a legendary Sri Lankan artistic family lineage\n• Over three decades of work across film, television, theatre and music\n\nSignature roles\nMajor Vikum (Gamani)\nSube (Sakkarang)\nSachithra (Dekala Purudu Kenek)\nInspector Wikrama (Kawuruth Danne Na)\nUvindu (Adaraneeya Kathawak)\nClifford Dunuwila (1970 Love Story)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499170543-Bimal-Jayakody.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":12,"castMemberCommonResDTO":{"id":43,"name":"Aruni Rajapaksha","bio":"Actress · Model · TV Host · Beauty Queen\nSri Lanka · Active since 2004\n\nAruni Rajapaksha is a Sri Lankan actress, model and television host who entered the public spotlight after winning two major pageant titles — Udarata Menike 2004 and Capri Beauty Queen 2005. She later moved into acting, television presenting and brand work, becoming a familiar face across cinema, fashion and entertainment media in Sri Lanka.\n\nShe made her film debut in Super Six (2012) as the lead actress, followed by key roles in historical, dramatic and musical films such as Maharaja Gemunu, Address Na, Paththini and Adaraneeya Kathawak. Known for her elegant screen presence, she has appeared in both commercial and period cinema, often portraying graceful, poised and strong female characters.\n\nAlongside acting, Aruni has hosted several popular lifestyle and talk shows including Hello Sri Lanka and Liyasevana, extending her career into television presenting and live entertainment.\n\nCareer highlights\n• Crowned Udarata Menike (2004) & Capri Beauty Queen (2005)\n• Lead actress in Super Six and featured in Maharaja Gemunu, Paththini and Adaraneeya Kathawak\n• TV host for multiple programmes on mainstream Sri Lankan television\n• Fashion model with national recognition before entering film\n\nPersonal\nBorn in Kalpitiya and raised in Kandy, Aruni transitioned from technical studies to modelling before entering pageantry. She is married to Nalin Samarawickrama and is the mother of twin daughters.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499310694-Aruni-Rajapaksha.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":13,"castMemberCommonResDTO":{"id":55,"name":"Roshan Ravindra","bio":"Actor · Director · Producer · Makeup Artist\nSri Lanka · Active since early 2000s\n\nRoshan Ravindra is a critically acclaimed Sri Lankan actor known for his powerful dramatic performances across cinema, television and theatre. Regarded as one of the strongest method-driven actors in Sinhala drama, he has won multiple Best Actor awards at the Sumathi, Raigam, Sarasaviya, Presidential and State TV Awards for his intense, character-immersive roles.\n\nBefore becoming an actor, Ravindra trained in theatre and worked behind the camera as a makeup artist, assistant director and producer — a technical background that shaped his detail-oriented acting style. His breakout role came with the television epic Uthuwan Kande Sura Saradiyal, followed by the widely praised series Sahodaraya and his award-winning performance in Weeraya Gedara Awith. In 2020, he made his directorial debut with the teledrama Thanamalvila Kollek, which later won Best Director at major TV award ceremonies.\n\nOn the film front, he is best known for Aadaraneeya Wassanaya, Sulanga Gini Aran, Aloko Udapadi, Address Na and Guru Geethaya, earning both national and festival recognition for supporting and lead roles.\n\nCareer Highlights\n• Best Actor – Sumathi Awards (Weeraya Gedara Awith, Abarthu Atha)\n• Best Supporting Actor – Sarasaviya & Presidential Awards (Sulanga Gini Aran)\n• Best Director – Sumathi & Raigam (Thanamalvila Kollek)\n• Known for lead roles in Uthuwan Kande Sura Saradiyal, Sahodaraya, Daskon, Weeraya Gedara Awith\n• Film performances range from romantic drama (Aadaraneeya Wassanaya) to historical epics (Aloko Udapadi)\n\nSignature Roles\nKasun – Aadaraneeya Wassanaya\nTheeya Brahmin – Aloko Udapadi\nEmbilipitiye Karaa – Address Na\nLead Actor – Weeraya Gedara Awith\nDirector – Thanamalvila Kollek","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504655889-Roshan-Ravindra.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":14,"castMemberCommonResDTO":{"id":56,"name":"Darshan Dharmaraj","bio":"Actor · Sri Lanka (1981–2022)\nTamil & Sinhala Cinema · Theatre · Television\n\nDarshan Dharmaraj was one of the most compelling screen actors of his generation, celebrated for his intense, deeply internalised performances across both Sinhala and Tamil cinema. Born in Rakwana and educated at St. John’s Tamil College, he entered the industry in 2008 through the television serial A9, learning Sinhala from scratch in just three months — a testament to his discipline and artistic curiosity.\n\nHis breakthrough came with Ini Avan (2012), where he portrayed a former LTTE cadre with extraordinary emotional restraint and physical realism. The role earned him multiple Best Actor awards, including the Derana Lux Film Award (2013) and the Hiru Golden Film Award (2014), cementing his status as a leading dramatic actor in Sri Lankan cinema.\n\nDharmaraj’s filmography spans socio-political dramas, commercial cinema and arthouse storytelling, in titles such as Prabhakaran, Matha, Address Na, Aloko Udapadi, House of My Fathers, Bhavatharana and Tsunami. He was equally acclaimed on stage and television, noted for his ability to shift between languages, character types and psychological registers with remarkable authenticity.\n\nDarshan Dharmaraj passed away on 2 October 2022 at the age of 41, leaving behind a legacy of groundbreaking roles that expanded the representation of Tamil characters and post-war narratives in Sri Lankan cinema.\n\nSignature roles\n• Ini Avan – Ex-LTTE cadre (Best Actor, multiple awards)\n• Prabhakaran – LTTE leader\n• Address Na – Gubbayame Goring\n• House of My Fathers – Multilingual ensemble\n• Praana – King Cankili\n• Komaali Kings – Mohan (Tamil cinema)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762504813133-Darshan-Dharmaraj.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":15,"castMemberCommonResDTO":{"id":57,"name":"Wasantha Wittachchi","bio":"Actor · Master Makeup Artist (1959–2025)\nSri Lankan Cinema · Theatre · Television\n\nWasantha Chandrawansa Wittachchi was a legendary figure in Sri Lankan performing arts, celebrated not only as a character actor but as one of the most influential makeup artists in the history of Sinhala stage, cinema and television. Over a four-decade career, he became the only makeup artist in the country to win national awards across all three mediums, while also building a respected body of acting roles in teledramas and feature films.\n\nBorn in Colombo and trained under the great dramatists of the Lionel Wendt era, Wittachchi entered theatre in the late 1970s and quickly evolved from performer to master craftsman, learning under icons such as Shesha Palihakkara. His makeup work defined the visual language of landmark productions including Sihina Deshayen, Uppalawanna, Kusa Paba, Mille Soya, Aba and Vijaya Kuweni, while his acting roles in Bumuthurunu, Dandubasnāmānaya, Arungal, Address Na, Paththini and Gharasarapa earned him a loyal following on screen.\n\nA revered teacher and mentor at Tower Hall, Sripalee and the Youth Service Council, Wittachchi trained multiple generations of actors and makeup designers, shaping the aesthetic of modern Sri Lankan theatre. He passed away in February 2025, leaving behind a legacy of innovation, discipline and artistic generosity.\n\nSignature acting roles\n• Bumuthurunu – Uncle Norris\n• Arungal – State Award: Best Supporting Actor\n• Address Na – Police Officer\n• Gharasarapa – Vishwanadan\n• Paththini – Paththini Hami\n\nSignature makeup credits\n• Sihina Deshayen – Multiple top awards\n• Uppalawanna · Aba · Kusa Paba · Mille Soya · Vijaya Kuweni","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505011468-Wasantha_Wittachchi_800pX800p-Recovered.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":16,"castMemberCommonResDTO":{"id":47,"name":"Anjalee Liyanage","bio":"Actress · Performer · Public Personality\nSri Lanka · Active in film & television\n\nAnjali Liyanage is a Sri Lankan actress known for her versatile range and captivating on-screen presence. Over the years, she has earned recognition as a reliable and expressive performer, taking on roles that span drama, romance, comedy and family storytelling. Her natural screen charisma and emotional depth have made her a familiar face in both television and cinema.\n\nBeyond acting, Anjali maintains an active digital presence, connecting with audiences through her official social media channels. She uses Instagram (@sl_anjalee_liyanage) to share behind-the-scenes moments, lifestyle posts, production updates and direct interaction with fans, while her Twitter feed highlights industry news and upcoming projects.\n\nHer official website features a detailed biography, portfolio gallery, featured video clips and announcements, showcasing her multi-layered career and ongoing work in the entertainment industry.\n\nRecognised for\n• Strong emotional performances across multiple genres\n• Consistent presence in Sri Lankan entertainment\n• Active engagement with audiences across social platforms","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762499694273-Anjali_Liyanage_800pX800p.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}}],"subtitles":[],"genres":[{"genreId":23,"genreName":"Action"},{"genreId":33,"genreName":"Crime"}],"keywords":[{"keywordId":23,"keywordName":"Movie"},{"keywordId":26,"keywordName":"Action"},{"keywordId":28,"keywordName":"Crime"}],"video":{"id":70,"title":"address_na mp4","resolutions":"[\"240p\", \"360p\", \"720p\", \"1080p\"]","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/address_na/video/hls/09-Apr-21-71514_FILM_ADDRESSNAFULMOVES.m3u8\n","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/address_na/video/hls/09-Apr-21-71514_FILM_ADDRESSNAFULMOVES.m3u8","conversionStatus":"COMPLETE","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"posters":[{"id":701,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655813607-adress_naa_titel1080.png","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655813607-adress_naa_titel1080.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":702,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655821110-adress_naa_lanscape_with_logo.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655821110-adress_naa_lanscape_with_logo.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":703,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655822442-adress_naa_lanscape_without_logo.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655822442-adress_naa_lanscape_without_logo.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":704,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"BACKGROUND_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655826538-adress_naa_lanscape_without_logo.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655826538-adress_naa_lanscape_without_logo.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":705,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655831258-Address_na_portrait_without_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655831258-Address_na_portrait_without_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":706,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761655833927-Address_na_portrait_with_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761655833927-Address_na_portrait_with_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":758,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761704632569-Address_na_portrait_without_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761704632569-Address_na_portrait_without_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":759,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761704634730-Address_na_portrait_with_titel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761704634730-Address_na_portrait_with_titel.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":960,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763868143008-Address_na_title.png","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763868143008-Address_na_title.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":961,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763868145215-Address_na_without_titekll_portrait_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763868145215-Address_na_without_titekll_portrait_base_template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":962,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1763868147559-Address_na_with_titekll_portrait_base_template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1763868147559-Address_na_with_titekll_portrait_base_template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"}],"mediaTrailer":{"id":113,"title":"Address Na Trailer","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1763979144132-Address Ne Trailer.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1763979144132-Address%20Ne%20Trailer/master.m3u8","conversionStatus":"TRANSCODED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"monetization":{"freeClientPackage":[1],"advertisingAllowed":false,"payToWatchPackageDTOS":[{"payToWatchClientPackageId":2,"priceLkr":0.0,"priceUsd":0.0,"rentalDurationInDays":7,"watchingDurationInDays":3}]},"audienceType":"GENERAL","isVectorIndexingDone":false},{"id":53,"tenantId":100101118,"createdUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"modifiedUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"createdAt":"2025-11-07T05:43:32.063+00:00","updatedAt":"2025-11-25T08:39:46.985+00:00","publishStatus":"PUBLISHED","publishedBy":null,"asyncElasticSearch":true,"isDeletedBy":null,"isDeleted":false,"allowDownloads":true,"allowGuestUsersToWatch":true,"allowEarlyAccess":false,"maturityRating":"NC_17","maturityRatingTxtField":null,"listingCountryType":"BLACKLISTING_COUNTRIES","countries":[{"id":26,"name":"Argentina"}],"earlyAccessDate":"2025-01-01","vttUrl":"https://example.com/media/interstellar_test","contentStatus":"UNPUBLISHED","posterConversionStatus":"UNPUBLISHED","title":{"titleEn":"Aksharaya","titleSi":"Aksharaya","titleTa":"Aksharaya"},"slug":"aksharaya","description":"A runaway 12-year-old, haunted by a fatal mistake, uncovers the twisted secrets of his powerful parents. As his magistrate mother descends into madness, guilt and desire explode into violence—ending in a tragic, unforgettable climax.","releaseDate":"2005-09-25","runtime":"PT02H16M","publishDate":null,"unPublishDate":null,"director":[{"id":67,"name":"Asoka Handagama","bio":"Writer · Director · Playwright · Television Creator\nOne of Sri Lanka’s most provocative and internationally acclaimed filmmakers\n\nAsoka Handagama is regarded as a revolutionary voice in Sri Lankan cinema, known for bold storytelling that challenges politics, gender, war, and social morality. Trained in mathematics (BSc First Class – University of Kelaniya) and Development Economics (MSc – University of Warwick), Handagama combines intellectual precision with cinematic risk-taking. Beyond film, he is also an Assistant Governor of the Central Bank of Sri Lanka, making him one of the few global filmmakers who operates between the worlds of art, policy, and economics.\n\nBeginning in theatre, Handagama won national awards for direction before moving into television, where he redefined the Sri Lankan tele-series form with Dunhinda Addara and Synthetic Sihina. His films – including Me Mage Sandai, Flying with One Wing, Ini Avan, and the banned cult classic Aksharaya – have screened at Cannes, San Sebastian, Tokyo, Toronto, and more than 50 international festivals, winning global acclaim and igniting local controversy.\n\nHis 2012 film Ini Avan premiered at Cannes (ACID selection), while Flying with One Wing won Best Asian Film at the Tokyo International Film Festival. Aksharaya, banned in Sri Lanka, became one of the most-watched Sri Lankan films online, crossing 3 million views.\n\nSELECTED FILMS\n\nMe Mage Sandai (2000)\nFlying with One Wing (2002)\nAksharaya (2005)\nVidhu (2010)\nIni Avan (2012)\nLet Her Cry (2016)\nAsandhimitta (2019)\nAlborada (2022)\nRani (2025)\n\nTELEVISION & THEATRE HIGHLIGHTS\n\nDunhinda Addara – swept all major OCIC awards (1994)\nSynthetic Sihina – experimental political tele-series\nTake This Road – filmed in Jaffna during ceasefire (2004)\nEast is Calling – Best Teleseries of the Year (2007)\nMagatha – State Drama Festival Best Play & Best Director (1989)\nA Death at an Antique Shop (2021) – return to theatre after 30 years\n\nNOTABLE AWARDS\n\n• Best Asian Film – Tokyo IFF (Flying with One Wing)\n• Audience Award – Torino FF (Flying with One Wing)\n• OCIC Awards – Best Film, Director & Screenplay (Chanda Kinnari)\n• State Drama Festival – Best Director & Best Script\n• Sumathi & Raigam Awards – Best Director / Best Script (TV)\n• Cannes ACID Selection – Ini Avan (2012)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762506965419-Ashoka-Handagama.jpg","roleCommonResDTO":null}],"producer":[],"cast":[{"priorityNo":1,"castMemberCommonResDTO":{"id":67,"name":"Asoka Handagama","bio":"Writer · Director · Playwright · Television Creator\nOne of Sri Lanka’s most provocative and internationally acclaimed filmmakers\n\nAsoka Handagama is regarded as a revolutionary voice in Sri Lankan cinema, known for bold storytelling that challenges politics, gender, war, and social morality. Trained in mathematics (BSc First Class – University of Kelaniya) and Development Economics (MSc – University of Warwick), Handagama combines intellectual precision with cinematic risk-taking. Beyond film, he is also an Assistant Governor of the Central Bank of Sri Lanka, making him one of the few global filmmakers who operates between the worlds of art, policy, and economics.\n\nBeginning in theatre, Handagama won national awards for direction before moving into television, where he redefined the Sri Lankan tele-series form with Dunhinda Addara and Synthetic Sihina. His films – including Me Mage Sandai, Flying with One Wing, Ini Avan, and the banned cult classic Aksharaya – have screened at Cannes, San Sebastian, Tokyo, Toronto, and more than 50 international festivals, winning global acclaim and igniting local controversy.\n\nHis 2012 film Ini Avan premiered at Cannes (ACID selection), while Flying with One Wing won Best Asian Film at the Tokyo International Film Festival. Aksharaya, banned in Sri Lanka, became one of the most-watched Sri Lankan films online, crossing 3 million views.\n\nSELECTED FILMS\n\nMe Mage Sandai (2000)\nFlying with One Wing (2002)\nAksharaya (2005)\nVidhu (2010)\nIni Avan (2012)\nLet Her Cry (2016)\nAsandhimitta (2019)\nAlborada (2022)\nRani (2025)\n\nTELEVISION & THEATRE HIGHLIGHTS\n\nDunhinda Addara – swept all major OCIC awards (1994)\nSynthetic Sihina – experimental political tele-series\nTake This Road – filmed in Jaffna during ceasefire (2004)\nEast is Calling – Best Teleseries of the Year (2007)\nMagatha – State Drama Festival Best Play & Best Director (1989)\nA Death at an Antique Shop (2021) – return to theatre after 30 years\n\nNOTABLE AWARDS\n\n• Best Asian Film – Tokyo IFF (Flying with One Wing)\n• Audience Award – Torino FF (Flying with One Wing)\n• OCIC Awards – Best Film, Director & Screenplay (Chanda Kinnari)\n• State Drama Festival – Best Director & Best Script\n• Sumathi & Raigam Awards – Best Director / Best Script (TV)\n• Cannes ACID Selection – Ini Avan (2012)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762506965419-Ashoka-Handagama.jpg","roleCommonResDTO":null}},{"priorityNo":2,"castMemberCommonResDTO":{"id":68,"name":"Iranthi Abeysinghe","bio":"Not available","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762507002421-Iranthi-Abeysinghe.jpg","roleCommonResDTO":null}},{"priorityNo":3,"castMemberCommonResDTO":{"id":69,"name":"Laurent Aléonard","bio":"Not available","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762507060335-Laurent-Aleonard.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":4,"castMemberCommonResDTO":{"id":58,"name":"Piyumi Samaraweera","bio":"Actress · Sri Lankan Cinema\n\nPiyumi Samaraweera is best known for her performance in the feature film A Letter of Fire (2005), where she gained recognition for her emotionally grounded screen presence and natural acting style. Though selective with her roles, her work has earned her a strong following among audiences appreciative of character-driven cinema.\n\nNotable Work\n• A Letter of Fire (2005) – Featured Role","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505305724-Piyumi_Samaraweera.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":5,"castMemberCommonResDTO":{"id":59,"name":"Hisham Samsudeen","bio":"Actor · Sri Lankan Film & Television\n\nHisham Samsudeen is a Sri Lankan actor recognised for his roles across fantasy, family, and drama-based cinema. He first gained attention for his performance in the critically discussed film Aksharaya (2005), and later became widely known for popular youth-focused titles such as Ran Kevita (2007) and its sequel Ran Kewita 2 (2013). His work in the fantasy-comedy Bomba Saha Rosa (2013) further established him as a familiar screen presence in mainstream Sinhala cinema.\n\nKnown for\n• Aksharaya (2005) – Psychological Drama\n• Ran Kevita (2007) – Fantasy/Adventure\n• Ran Kewita 2 (2013) – Fantasy/Comedy Sequel\n• Bomba Saha Rosa (2013) – Family/Adventure","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505438897-Hisham_Samsudeen_800pX800p-Recovered.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":6,"castMemberCommonResDTO":{"id":60,"name":"Ravindra Randeniya","bio":"Legendary Actor · Sri Lankan Cinema Icon\n\nRavindra Randeniya is one of Sri Lankan cinema’s most celebrated screen legends, with a career spanning over five decades and more than 100 films. Rising to prominence through Lester James Peries’ Desa Nisa (1975), Randeniya became the defining leading man of the 1970s–80s, earning multiple Best Actor awards for landmark roles in Dadayama, Maya, Sandakada Pahana and Siri Medura. Known for his commanding screen presence, intense character work and dramatic range, he remains a cultural figure whose influence extends to television, politics and arts education.\n\nNotable Films\n• Desa Nisa (1975)\n• Dadayama (1983) – Best Actor, Sarasaviya\n• Maya (1985) – Best Actor, Sarasaviya\n• Sandakada Pahana (1989) – Best Actor, Sarasaviya\n• Siri Medura (1990) – Best Actor, Sarasaviya\n• Seilama (1995) – Best Actor\n• Aksharaya (2005) – Retired High Court Judge\n\nCareer Highlights\n• 4× Sarasaviya Best Actor Winner\n• Lifetime Achievement Awards – Presidential, Raigam, Hiru, Derana\n• Former Member of Parliament (2000–2004)\n• Host of hit TV quiz show Mind Star\n\nShort OTT bio (150 characters):\nNational film icon and multi-award-winning actor, known for Dadayama, Maya, Sandakada Pahana and Aksharaya.\n\nUltra-short cast tag (70 characters):\nLegendary Best Actor of Dadayama, Maya and Aksharaya.","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505593112-Ravindra-Randeniya.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":7,"castMemberCommonResDTO":{"id":61,"name":"Saumya Liyanage","bio":"Award-Winning Actor · Theatre Intellectual · Screen Dramatic Specialist\n\nSaumya Liyanage is one of Sri Lanka’s most respected dramatic actors, celebrated for his powerful performances in cinema, theatre and television. Known for deeply intellectual, character-driven roles, he has won multiple Best Actor awards and is widely regarded as a master of psychological and philosophical acting. Beyond his on-screen career, Saumya is an academic leader, serving as the Dean of the Faculty of Graduate Studies at the University of the Visual & Performing Arts.\n\nNotable Films\n• Aba (2008) – Habaraa\n• Walapatala (2008) – Dr. Delgoda\n• Nimnayaka Hudekalawa (2017) – Best Actor, Sarasaviya\n• Aswesuma (2001)\n• Sulanga Enu Pinisa (2005)\n• Aganthukaya (2007) – Best Actor\n\nTelevision Highlights\n• Sittara Gurunnanse (Debut, 1992)\n• Bambara Sakmana\n• Apparitions\n• Diul Gase Kola Sulange Wisira Yathi\n\nStage Highlights\nClouds Nine, Colombo Colombo, Apasu Herenna Be, Weeraya Merila, The Irresistible Rise of Mr. Signno\n\nCareer Tags\nActor · Theorist · Lecturer · Director · Researcher\n\nAwards\n• 3× Sarasaviya Award Winner (Best Actor / Best Supporting Actor)\n• Bunka Cultural Award (Drama/Acting)\n• State Drama Festival Best Actor Winner\n• ADSA Award for Academic Research in Acting","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505694084-Saumya-Liyanage.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":8,"castMemberCommonResDTO":{"id":62,"name":"Jayani Senanayake","bio":"Award-Winning Actress · Master of Drama & Comedy · 20+ Years in Screen & Stage\n\nJayani Senanayake is one of Sri Lanka’s most versatile actresses, known for shifting effortlessly between intense dramatic roles and sharp comedic performances. She has appeared in critically acclaimed films such as Sulang Kirilli, Walapatala and Goal, along with a prolific career in television and stage. Her screen presence is rooted in raw character work, emotional range and deep theatrical grounding.\n\nNotable Films\n• Sulang Kirilli (2003) – Violet\n• Walapatala (2008) – Sumana\n• Goal (2018) – Tharindu’s mother\n• Machan (2008) – Jasmine\n• Akasa Kusum (2008) – Leela\n• Sooriya Arana (2004) – Sediris’ concubine\n• Aksharaya (2005) – Servant\n\nTelevision Highlights\nAdo, Angani, Dhawala Kanya, Sanda Amawakai, Three-Wheel Malli, Weeraya Gedara Awith, Wara Peraliya, Rathi Virathi, Kampitha Vil\n\nStage Highlights\nBakamuna Weedi Basi, Saadaya Maarai Salli Hamarai, Weeraya Merila, Horu Samaga Heluwen, Sihina Horu Aran\n\nCareer Tags\nCinema · Teledrama · Stage · Dramatic Acting · Comedy · Character Specialist\n\nAwards\n• Bunka Cultural Award (2009 – Drama Performance)\n• Sumathi Merit Award (2013 – Me Wasantha Kalayay)\n• Multiple stage & television festival wins","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762505808094-Jayani-Senanayake.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":9,"castMemberCommonResDTO":{"id":63,"name":"Prasanjith Abeysuriya","bio":"Actor · Playwright · Director · Scholar · Icon of Sri Lankan Theatre\n\nPrasannajith Abeysuriya is a multi-disciplinary force in Sri Lankan performing arts, with a career spanning over four decades in stage, street theatre, television, academic research and creative direction. From winning Best Actor as a schoolboy in 1976 to becoming a Senior Lecturer and Dean at the University of Visual & Performing Arts, his journey bridges artistry, education, and cultural preservation.\n\nA pioneer of Sri Lankan street theatre through his long-term work with Gamini Hathtotuwagama’s Open Street Drama Group (1980–2002), Prasannajith later evolved into a celebrated playwright, director, choreographer, costume designer and mentor to new generations of performers.\n\nHis award-winning plays such as Dukgannarala and Dordanda remain landmark works in contemporary Sinhala theatre, studied in universities and performed internationally.\n\nCREATIVE ROLES\n\n• Actor (Stage / Screen)\n• Playwright & Scriptwriter\n• Stage Director\n• Academic & Researcher\n• Choreographer & Costume Designer\n• Theatre Educator & Cultural Ambassador\n\nSELECTED STAGE WORKS (Writer / Director / Actor)\n\nDukgannarala (1989)\nDordanda (1995)\nKelani Palama – 40 Years Tribute (2019)\nApahu Harenna Ba\nColombo Colombo\nWeeraya Merila\nHoru Samaga Heluwen\n\nPUBLICATIONS\n\n• Dukgannarala (1993)\n• Dordanda (1996)\n• Sri Lankawe Weedi Natya Kalawa (2016)\n• Somalatha Subasinghe Rangakala Karya Sadhanaya (2019)\n• Kelani Palama – Hathlis Wasaraka Rangabhishekaya (2019)\n\nMAJOR AWARDS\n\nBest Script Writer – State & Youth Drama Festival (1989, 1995)\nBest Director – Youth Drama Festival (1995)\nBest Actor – Inter-School Festival (1976)\nSumathi Award – Best Supporting Actor (2009)\nRaigam Award – Best Supporting Actor (2009)\nBUNKA AWARD (Japanese Embassy, 2009)\nMultiple awards for Acting, Directing, Costume & Choreography in National Festivals\n\nINTERNATIONAL REPRESENTATION\n\n• Theatre Workshops – India, Pakistan, Japan, France, USA\n• Performed Sinhabahu & Maname at UNESCO, Paris (2014)\n• Represented Sri Lanka at ASITEJ International Children’s Theatre Festival (Japan, 2012)\n• Workshops & Performances – Kerala ITFOK (2018), Rafi Peer Theatre Festival (Pakistan), New Jersey (USA)\n\nACADEMIC PROFILE\n\n• BA – University of Kelaniya\n• MA in Drama & Theatre – University of Sri Jayewardenepura\n• Senior Lecturer & Dean – Faculty of Graduate Studies, UVPA\n• Research Areas: Scriptwriting · Acting Theory · Choreography · Costume Design · Street Theatre Studies","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762506015778-Prasanjith-Abeysuriya.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":10,"castMemberCommonResDTO":{"id":64,"name":"Gayani Gisanthika","bio":"Film · Television · Theatre · Award-Winning Actress\n\nGayani Gisanthika Liyanaarachchi is a commanding presence in Sri Lankan performing arts, celebrated for her emotionally layered performances across cinema, television, and stage. Trained at the National Youth Centre and later at the Actor’s Lab, University of Melbourne, she combines classical theatrical grounding with contemporary acting technique, making her one of the most versatile actresses of her generation.\n\nHer career launched with a Best Actress Award (1993) for Tittha Kusalana at the National Youth Theatre Festival, marking the arrival of a rare dramatic talent. Since then, she has built a body of work spanning critically acclaimed theatre, award-winning television roles, and powerful screen performances under some of the most respected directors in Sri Lankan cinema.\n\nSELECTED FILM WORKS\n\nAmmawarune – Dir. Lester James Peries\nSarigama – Dir. Somarathne Dissanayake (Best Supporting Actress, 2016)\nOther notable feature roles in contemporary Sinhala cinema\n\nSELECTED TELEVISION ROLES\n\nMaddahana – Best Supporting Actress, 2017\nMultiple lead and supporting roles in acclaimed Sri Lankan teledramas\n\nSTAGE HIGHLIGHTS\n\nChe Guevara – Dir. Buddhika Damayantha\nA Streetcar Named Desire – Dir. Champa Buddhipala\nMultiple award-winning dramatic roles across national theatre festivals\n\nTRAINING & EDUCATION\n\n• National Youth Centre – Drama & Theatre Arts\n• Actor’s Lab, University of Melbourne – Advanced Screen & Stage Technique\n\nMAJOR AWARDS\n\nBest Actress – National Youth Theatre Festival (1993)\nBest Supporting Actress – Sarigama (2016)\nBest Supporting Actress – Maddahana (2017)","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762506152311-Gayani-Gisanthika.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":11,"castMemberCommonResDTO":{"id":65,"name":"Somasiri Alakolange","bio":"Veteran Actor · Sri Lankan Cinema & Television\n\nSomasiri Alakolange is a long-standing figure in Sri Lankan film and television, best recognised for his supporting roles across crime, drama, and comedy. With a career spanning several decades, he has worked with some of the country’s most influential filmmakers, becoming a familiar and respected presence in Sinhala cinema.\n\nHe is widely remembered for performances in films such as the cult crime drama Gini Avi Saha Gini Keli (1998), the internationally discussed Aksharaya (2005), the political drama Walapatala (2008), the hit comedy Suhada Koka (2015), and the biographical feature Nidahase Piya DS (2018).\n\nSELECTED FILMOGRAPHY\n\n• Gini Avi Saha Gini Keli (1998) – Crime Drama\n• Aksharaya (2005) – Psychological Drama\n• Walapatala (2008) – Political Drama\n• Suhada Koka (2015) – Comedy\n• Nidahase Piya DS (2018) – Biographical Drama","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1762506439690-Somasiri-Alakolange.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}}],"subtitles":[],"genres":[{"genreId":28,"genreName":"Drama"},{"genreId":33,"genreName":"Crime"},{"genreId":37,"genreName":"Mature"}],"keywords":[{"keywordId":23,"keywordName":"Movie"},{"keywordId":28,"keywordName":"Crime"},{"keywordId":29,"keywordName":"Mature"}],"video":{"id":59,"title":"JSA_TVC_30SEC_C_02","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1761550310799-JSA_TVC_30SEC_C_02.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1761550310799-JSA_TVC_30SEC_C_02/master.m3u8","conversionStatus":"COMPLETED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"posters":[{"id":853,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492745903-Aksharaya_landscape_without_Titel__template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492745903-Aksharaya_landscape_without_Titel__template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":854,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492748249-Aksharaya_landscape_with_Titel__template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492748249-Aksharaya_landscape_with_Titel__template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":855,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492750380-Aksharaya_TItel.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492750380-Aksharaya_TItel.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":856,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"BACKGROUND_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492757149-Aksharaya_landscape_without_Titel__template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492757149-Aksharaya_landscape_without_Titel__template.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":857,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492765770-Aksharaya_portrait_with_Titel__template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492765770-Aksharaya_portrait_with_Titel__template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":858,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1762492768943-Aksharaya_portrait_without_Titel__template.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1762492768943-Aksharaya_portrait_without_Titel__template.webp","posterOrientation":"PORTRAIT","posterType":"WEB"}],"mediaTrailer":{"id":93,"title":"Aksharaya Trailer","resolutions":"[\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1762494185650-Aksharaya Trailer.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1762494185650-Aksharaya%20Trailer/master.m3u8","conversionStatus":"TRANSCODED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"monetization":{"freeClientPackage":[1],"advertisingAllowed":false,"payToWatchPackageDTOS":[]},"audienceType":"GENERAL","isVectorIndexingDone":false},{"id":49,"tenantId":100101118,"createdUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"modifiedUser":{"id":1,"displayName":"rumex-dev","email":"admin@rumex.lk"},"createdAt":"2025-10-28T17:55:52.845+00:00","updatedAt":"2025-11-25T08:38:29.717+00:00","publishStatus":"PUBLISHED","publishedBy":null,"asyncElasticSearch":true,"isDeletedBy":null,"isDeleted":false,"allowDownloads":true,"allowGuestUsersToWatch":true,"allowEarlyAccess":false,"maturityRating":"G","maturityRatingTxtField":null,"listingCountryType":"BLACKLISTING_COUNTRIES","countries":[{"id":26,"name":"Argentina"}],"earlyAccessDate":"2025-01-01","vttUrl":"https://example.com/media/interstellar_test","contentStatus":"UNPUBLISHED","posterConversionStatus":"UNPUBLISHED","title":{"titleEn":"Appachchigen Ahanna","titleSi":"Appachchigen Ahanna","titleTa":"Appachchigen Ahanna"},"slug":"appachchigen_ahanna","description":"She left for a richer life. Now, he's the one who has it all. A story of love, loss, and regret..","releaseDate":"2025-03-13","runtime":"PT0154M","publishDate":null,"unPublishDate":null,"director":[],"producer":[],"cast":[{"priorityNo":1,"castMemberCommonResDTO":{"id":95,"name":"Wishwa Lanka Panditharathne","bio":"Actor | Director | Television Personality\n\nWishwa Lanka Panditharathna is a Sri Lankan actor and director known for his dynamic screen presence and strong performances across television and cinema. Born on November 30th in Kuliyapitiya, he built his artistic foundation at Kuliyapitiya Central College before stepping into the entertainment industry. Well-recognized for his work with TV Derana, Wishwa has grown into a familiar face in teledramas, historical epics, and contemporary films.\n\nBeyond acting, he has showcased his storytelling ability as a director, especially through notable series such as Seesarla and Mahaarani, earning a reputation as a versatile creative professional.\n\nHe is married to Dilunika Thilini.\n\nFeatured Works\nTELEDRAMAS\n\nEncounter – Actor\n\nGamunu Maharaja – Season 1 – Actor\n\nIdora Wassa – Actor\n\nFun FM – Actor\n\nSeesarla – Actor / Director\n\nMahaarani – Actor / Director\n\nFILMS\n\nRan Sayura (2017) – Actor\n\nSuparna (2019) – Actor\n\n64 Mayam (2016) – Actor\n\nAnithya (2013) – Actor\n\nSiri Daladagamanaya (2014) – Actor\n\nRuhire (2022) – Actor\n\nBreaking News – Actor\n\nStyle & Impact\n\nWishwa Lanka is admired for:\n\nStrong character portrayals in historical and contemporary roles\n\nSmooth transition between acting and directing\n\nConsistent presence across popular mainstream teledramas\n\nA loyal viewer base cultivated through his long-standing work with national TV networks","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764058181002-Wishwa-Lanka.jpg","roleCommonResDTO":{"roleId":8,"roleName":"Director / Producer / Actor"}}},{"priorityNo":2,"castMemberCommonResDTO":{"id":96,"name":"Upeksha Swarnamali","bio":"Actress | Television Icon | Former Member of Parliament\n\nUpeksha Swarnamali, popularly known as “Paba”, is a Sri Lankan actress, model, and former parliamentarian whose rise to fame began with her title-role performance in the hit teledrama Paba. Known for her expressive acting style and strong screen presence, she became one of the most recognized faces on Sri Lankan television in the 2000s.\n\nBorn in Kuwait and raised abroad for two decades, Upeksha returned to Sri Lanka in 2004 and quickly established herself in modeling, music videos, and television. Her popularity as an actress soon transitioned into national politics, where she entered Parliament representing the Gampaha District with over 81,000 preferential votes. Even after leaving politics in 2015, she remained an influential public figure through acting, media appearances, and advocacy work.\n\nSignature Works on OTT\nTELEDRAMAS\n\nPaba – Breakthrough lead role that made her a household name\n\nAganthukaya – Popular dramatic performance\n\nAhas Maliga – Notable role (where she survived a real-life cobra bite)\n\nBindunu Sith\n\nDekada Kada\n\nDivyadari\n\nOba Nisa\n\nSamanalunta Wedithiyanna\n\nThathparayak Denna\n\nFILMS\n\nAsai Man Piyabanna (2007) – Ranmalee’s sister\n\nAkasa Kusum (2009) – Film actress\n\nTikiri Suwanda (2010) – Nilmini\n\nUththara (2010)\n\nSuseema (2011)\n\nBomba Saha Rosa (2012) – Shani\n\nCindrella (2016) – Lead role as Isanka\n\nMaya 3D (2016) – Nirmala\n\nMaanaya (2019)\n\nRashmi (2022) – Rashmi\n\nRidee Seenu (2024) – Mother\n\nSithija Seya – Upcoming\n\nPolitical Career\n\nUpeksha made headlines when she entered Parliament in 2010 under the United National Party, securing a massive vote base. Her political journey included:\n\nServing as Member of Parliament (Gampaha District)\n\nVoting for the 18th Amendment and crossing over to the UPFA/SLFP\n\nAppointment as Monitoring Minister of Foreign Employment\n\nStepping away from active politics in 2015\n\nStyle & Impact\n\nUpeksha Swarnamali is admired for:\n\nA charismatic blend of glamour and authenticity\n\nVersatility across drama, romance, and socially sensitive roles\n\nA bold public personality shaped by acting, politics, and advocacy\n\nMaintaining her fanbase through strong media presence","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764058322920-Upeksha-Swarnamali.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":3,"castMemberCommonResDTO":{"id":97,"name":"Pabudi Kaveesha","bio":"Dancer | Actress | Child Star | Reality Show Finalist\n\nPabudi Kaveesha is a rising Sri Lankan dancer who captured national attention from an early age through her expressive performances, technical skill, and charismatic stage presence. She first became a household name when she won the Under-8 Dancing Title at Derana Little Star in 2014. Her popularity continued to soar, earning her the “Popular Star” title in the show’s 6th season.\n\nIn 2022, she elevated her status even further as a finalist in \"Sri Lanka’s Best Dancer\", showcasing her growth from a child prodigy into a refined young performer with strong artistic identity. Known online as @pabuu_shenali on Instagram, she frequently shares dance clips, rehearsals, and lifestyle content with an expanding fan base.\n\nReality Show Highlights\nDerana Little Star (2014)\n\nWinner – Under-8 Dancing Category\n\nAwarded “Popular Star” in Season 6\n\nWidely recognized for sharp technique and expressive performances\n\nSri Lanka’s Best Dancer (2022)\n\nFinalist\n\nPraised for versatility across contemporary, freestyle, and traditional dance forms","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764058559908-Pabudi-Kaveesha.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":4,"castMemberCommonResDTO":{"id":98,"name":"Pubudu Buddhika","bio":"Not Available","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764059369263-Pubudu-Buddhika.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":5,"castMemberCommonResDTO":{"id":99,"name":"Deshitha Kawinda Peiris","bio":"Actor | TV Presenter | Commercial Model | Dancer\n\nDeshitha Kawinda Peiris is an emerging Sri Lankan actor and media personality recognized for his charismatic screen presence, versatility, and rising influence across television and digital media. With experience spanning acting, presenting, modelling, and dance, he has quickly positioned himself as a multi-talented performer in the entertainment industry.\n\nHe is widely known for his roles in popular teledramas such as “Man Adarei” and “Nikini Kusum,” where he continues to earn attention for his expressive acting and relatable character portrayals. Alongside his screen work, Deshitha is active as a commercial model, collaborating with brands for promotional campaigns, photoshoots, and advertising projects.\n\nBalancing his creative career with academic excellence, he is currently pursuing a BA (Hons) Degree in Film and Television Studies at the University of Kelaniya, sharpening his craft with professional training, production knowledge, and industry-oriented study.\n\nIn addition to performing, Deshitha also works behind the camera as the Owner, Editor, and Director at his own creative label, continually expanding his skill set within film and media production.\n\nActing Highlights\n\nMan Adarei – Actor\n\nNikini Kusum – Actor\n\nTelevision & Media Work\n\nTV Presenter & Host\n\nVoice and announcement work\n\nSocial media promotion and branded content creator\n\nModelling & Commercial Work\n\nCommercial model for multiple campaigns\n\nPhotoshoots, brand promotions, and lifestyle content\n\nStrong digital presence boosting brand visibility\n\nEducation\n\nBA (Hons) in Film and Television Studies\nUniversity of Kelaniya","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764059557710-Deshitha-Kawinda.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}},{"priorityNo":6,"castMemberCommonResDTO":{"id":101,"name":"Gihansi Dulanya","bio":"Singer | Reality TV Performer | Emerging Young Talent\n\nGihansi Dulanya is a rising young Sri Lankan singer who gained national attention through her standout performances on Derana Little Star Season 11. With a natural gift for melody, confidence on stage, and an expressive singing style well beyond her age, she quickly became one of the most loved contestants of the season.\n\nHer performances, including popular renditions such as “Mata Bombay Dilhi”, have gone viral across YouTube and social media, further boosting her presence among young audiences. Gihansi has also taken part in competitive segments like “Little Titans”, showcasing her versatility, agility in performance, and ability to handle challenging musical pieces live.\n\nAs her fanbase continues to grow, Gihansi is emerging as a bright young star in Sri Lanka’s next generation of performers, with strong potential to expand into professional music, television, and digital entertainment.\n\nReality TV & Competitions\n\nDerana Little Star – Season 11\nBreakout contestant recognized for her strong vocals and stage charisma.\n\nLittle Titans Singing Challenges\nParticipated in high-energy singing battles and challenge performances.\n\nNotable Performances\n\n“Mata Bombay Dilhi” – Popular performance loved by viewers\n\nMultiple challenge songs and duets featured on TV and YouTube\n\nTalent Highlights\n\nStrong vocal control and pitch accuracy\n\nHigh stage confidence at a young age\n\nLarge and growing social-media following\n\nPopular across children’s music programs and digital music clips","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764059822216-Gihansi-Dulanya.jpg","roleCommonResDTO":{"roleId":3,"roleName":"Actress"}}},{"priorityNo":7,"castMemberCommonResDTO":{"id":100,"name":"Sampath Randeniya","bio":"Not Available","photoUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/images/1764059688635-Sampath-Randeniya.jpg","roleCommonResDTO":{"roleId":1,"roleName":"Actor"}}}],"subtitles":[],"genres":[{"genreId":28,"genreName":"Drama"},{"genreId":29,"genreName":"Family"}],"keywords":[{"keywordId":23,"keywordName":"Movie"},{"keywordId":24,"keywordName":"Family"}],"video":{"id":59,"title":"JSA_TVC_30SEC_C_02","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1761550310799-JSA_TVC_30SEC_C_02.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1761550310799-JSA_TVC_30SEC_C_02/master.m3u8","conversionStatus":"COMPLETED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"posters":[{"id":747,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674022778-LANDSCAPE_WITHOUT_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674022778-LANDSCAPE_WITHOUT_TITLE.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":748,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"LANDSCAPE_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674025448-LANDSCAPE_WITH_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674025448-LANDSCAPE_WITH_TITLE.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":749,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"TITLE_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674028231-APPACHCHIGEN_AHANNA_TITLE_PNG.png","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674028231-APPACHCHIGEN_AHANNA_TITLE_PNG.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":750,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"BACKGROUND_POSTER","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674032170-LANDSCAPE_WITH_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674032170-LANDSCAPE_WITH_TITLE.webp","posterOrientation":"LANDSCAPE","posterType":"WEB"},{"id":751,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674035114-PORTRAIT_WITH_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674035114-PORTRAIT_WITH_TITLE.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":752,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITH_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674102661-PORTRAIT_WITH_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674102661-PORTRAIT_WITH_TITLE.webp","posterOrientation":"PORTRAIT","posterType":"WEB"},{"id":753,"publishStatus":"PUBLISHED","asyncElasticSearch":false,"caption":"PORTRAIT_WITHOUT_TITLE","resolution":"1920x1080","sourceUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/1761674104129-PORTRAIT_WITHOUT_TITLE.jpg","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/posters/conversion/1761674104129-PORTRAIT_WITHOUT_TITLE.webp","posterOrientation":"PORTRAIT","posterType":"WEB"}],"mediaTrailer":{"id":59,"title":"JSA_TVC_30SEC_C_02","resolutions":"[\"1080p\",\"720p\",\"480p\",\"360p\",\"240p\"]","sourceUrl":"https://derana-plus.s3.ap-southeast-1.amazonaws.com/lms/videos/1761550310799-JSA_TVC_30SEC_C_02.mp4","cdnUrl":"https://dyp5fjwik91fw.cloudfront.net/lms/videos/conversion/1761550310799-JSA_TVC_30SEC_C_02/master.m3u8","conversionStatus":"COMPLETED","queuePoints":null,"videoType":null,"drmEnabled":false,"keyId":null},"monetization":{"freeClientPackage":[1],"advertisingAllowed":false,"payToWatchPackageDTOS":[]},"audienceType":"GENERAL","isVectorIndexingDone":true}],"number":0,"sort":{"sorted":false,"empty":true,"unsorted":true},"numberOfElements":5,"first":true,"last":false,"empty":false}